[{"review": "Absolutely delicious fresh fish prepared in a beautiful way. Timmy our server was awesome, the the live music made it a great evening!", "time": "October 27, 2016", "author": "Maureen R", "restaurant": "Ray's in the City"}, {"review": "My little cousin got married in Atlanta in August. We left Friday night from Naples, got caught behind a horrible accident north of Tampa in the rain (delayed for a few hours) and got to our hotel (The Ellis) right around 3:00 a.m. Saturday. Exhausted. Woke up around 9:00 hungry. Knew we were within walking distance of many good places", "time": "October 24, 2016", "author": "TwoWheelsOnly", "restaurant": "Ray's in the City"}, {"review": "We tried to eat here for a late lunch craving sushi about 1 pm. The place was virtually empty. We were promptly sat. And sat, sat, sat. After 20 minutes of watching approximately 12 staff members walk by without ever filling our water or acknowledging our presence, we left. Again, no one noticed, except the hostess who had just sat", "time": "October 24, 2016", "author": "Rachel G", "restaurant": "Ray's in the City"}, {"review": "Just amazing the flavors that mixed in my mouth. Make sure you order the fried goat cheese appetizer.", "time": "October 22, 2016", "author": "ayannaluv", "restaurant": "Ray's in the City"}, {"review": "While we couldn't travel to other areas of Atlanta, we were told that Ray's had been around for 20 years and was a good seafood restuarant in Atlanta. Frankly, Ray's is a typical center city restaurant. The seafood appeared fresh, but there was nothing special about the dishes or their preparation. Again, typical with the feel of a chain restaurant.", "time": "October 18, 2016", "author": "jjensen224", "restaurant": "Ray's in the City"}, {"review": "We live on HHI and evacuated to Atlanta. Ate at the bar the service was great and the food was very good and the prices were good. The Old Fashion Cocktail was great with good wines by the glass. Will go back on our next trip.\nJohnny\"D\"", "time": "October 17, 2016", "author": "Jon Dunn", "restaurant": "Ray's in the City"}, {"review": "Had Dinner after the Panther game and was pleasantly surprised to find Rays in the City. The seafood was fresh, local catch and delicious. Split the broilled platter with a little of everything. Plenty of food for two!", "time": "October 17, 2016", "author": "Kevin D", "restaurant": "Ray's in the City"}, {"review": "Never had grits before so decided to dive in with the Shrimp and Grits. Wow!\nBig helping of shrimp and very good grits.\nService was great.\nRecommended highly.", "time": "October 17, 2016", "author": "Dean S", "restaurant": "Ray's in the City"}, {"review": "After eating at Fire of Brazil the night before, I wasn't getting my hopes up that this will be different. I was so pleasantly surprised. The seafood was so fresh and abundant, the wine was excellent and I have to say probably the best Risotto I've ever had anywhere!", "time": "October 17, 2016", "author": "memccourt", "restaurant": "Ray's in the City"}, {"review": "We had 11 team members with us...Jasmine was our server...she was FABULOUS!...the food was AMAZING...Ray's in the City is a MUST!!", "time": "October 14, 2016", "author": "gingerswilley", "restaurant": "Ray's in the City"}, {"review": "Great food and wide selection of menu items. Even better is the server that we had! His name is Marcel and I would highly recommend asking for his table. He is personable, helpful, and gives impeccable service!", "time": "October 13, 2016", "author": "Jeanne M", "restaurant": "Ray's in the City"}, {"review": "We booked via Open Table.\nOur waiter was excellent, full of suggestions.\nHis menu knowledge was fantastic.\nHe suggested the Crab Bisque. Absolutely fantastic.\nI had the Shrimp and Grits. It was quite tasty.\nMy friend had the chicken, again excellent.\nI would defiantly return.", "time": "October 13, 2016", "author": "theruetwo", "restaurant": "Ray's in the City"}, {"review": "We reserved the Wine Room in back and had great servers, good wine and excellent food. We ordered seafood tower appetizer and it was fantastic. I ordered the filet and it was very good. Highly recommend this location even though it is expensive, but worth it.", "time": "October 12, 2016", "author": "Sjwiden", "restaurant": "Ray's in the City"}, {"review": "In one word .... \"Awewsome!\"\nNot only was the location, the atmosphere, and the food awesome, but more importantly, the personalized attention of the manager and our server, Bakary, was awesome as well! As first time visitors to this fine restaurant, we were impressed immensely with the fine balance between professionalism and friendliness. Ray's in the City was a great", "time": "October 12, 2016", "author": "Stezzie", "restaurant": "Ray's in the City"}, {"review": "My husband and I came to Ray's for our anniversary. We thoroughly enjoyed the experience. We were seated in a small secluded area in a corner/back left side of the restaurant. The hostesses were all very nice. One even gave us tips on parking in the area. I think my waiter was having a bad day. He didn't check on", "time": "October 11, 2016", "author": "LaKeisha W", "restaurant": "Ray's in the City"}, {"review": "Great staff! Fresh oysters!. Goat cheese pimento balls were a pleasant surprise. Had the fish and chips which were amazing and the tarter sauce tasted homemade!", "time": "October 10, 2016", "author": "Alita L", "restaurant": "Ray's in the City"}, {"review": "I got the crab cake for lunch and it was very good but not enough food in my opinion, I was still hungry. Staff was friendly and atmosphere was nice. Also have a pretty limited menu but that's pretty common at nicer restaurants.", "time": "October 8, 2016", "author": "Lauren T", "restaurant": "Ray's in the City"}, {"review": "We hadn't made any plans on where to eat, but this was right next door to our hotel so we decided to try it. I am very glad we did. Although we had about a 45 minute wait, it was worth it. I had the Parmesan crusted scallops with lobster Parmesan risotto. It was very good. The scallops were huge", "time": "October 6, 2016", "author": "Lakisha W", "restaurant": "Ray's in the City"}, {"review": "As a regular to Ray's in the City since its opening, what impresses me the most is their consistency on good quality food. With my visits in the past few years for lunch and dinner, I probably had tried most of the items on the menu and always end up with satisfaction. The location is right in the center of", "time": "October 5, 2016", "author": "Vince_Huang", "restaurant": "Ray's in the City"}, {"review": "I was here with my 2 friends, we have ordered steaks, oyster, shrimps, crème brûlée and wine.\nFood: oysters were good. Steaks were ok but crème brûlée was absolutely not good. It was covered with coconut and sugar was not only not crispy but fluffy!\nNow the worst: service. From the very beginning a waiter was ignoring us, when taking", "time": "October 3, 2016", "author": "Paula_Januszkiewicz", "restaurant": "Ray's in the City"}, {"review": "Rays was extremely good. Seafood was some of the best I've had. Waiter was very nice. Try it! Doubt you will be disappointed.", "time": "October 3, 2016", "author": "Alan B", "restaurant": "Ray's in the City"}, {"review": "My husband and I went there for dinner and even though the prices are high as expected, dinner was awesome. We both ordered the Lobster and whipped potatoes and both loved it. I wasn't too impressed with the drinks but then again I'm not much of a drinker.", "time": "October 3, 2016", "author": "Kandace M", "restaurant": "Ray's in the City"}, {"review": "Jasmine made a difference in an awesome way. Thank you for serving us with a great personality and a great smile.", "time": "October 2, 2016", "author": "JayLaLa W", "restaurant": "Ray's in the City"}, {"review": "Well reviewed restaurant that is is the middle of downtown and is a great place to have a business luncheon.", "time": "September 30, 2016", "author": "Jose311", "restaurant": "Ray's in the City"}, {"review": "Bartender was really nice and the sushi was pretty good, need to go back and try the expanded menu. Easy to get to.", "time": "September 25, 2016", "author": "Erika D", "restaurant": "Ray's in the City"}, {"review": "Josh my waiter was great, very attentive and genuine. Love the food and wine at Ray's in the city. Will definitely return!", "time": "September 15, 2016", "author": "Jacki683", "restaurant": "Ray's in the City"}, {"review": "I'm at a meeting in Atlanta - and we had a group that was interested in a diverse menu. Ray's seemed to fit that bill.....with steaks, fish, and sushi.\nWe were offered a table at the bar - there was some nice Jazz music playing. I could tell the evening was going to be rough when the waiter initially walked", "time": "September 15, 2016", "author": "Jon S", "restaurant": "Ray's in the City"}, {"review": "Stayed at the Westin and walked over to Rays for dinner. What a great place. Was lucky to get a seat at the bar to dine. Bartender was friendly. Ordered their calamari which was fantastic. The enjoyed the steak frites and topped it off smith creme brûlée. Great meal, definitely go if you're in the area.", "time": "September 14, 2016", "author": "jdsbiz98", "restaurant": "Ray's in the City"}, {"review": "Shrimp and Grits were very good. The gumbo was delicious as well. Their bar was a reasonably good place to be seated, although the bartender service left a little to be desired. They have a nice wine selection, and they had about 6 beers on tap (all seemed to be local brews). I'd recommend this place for anyone looking for", "time": "September 13, 2016", "author": "Alex B", "restaurant": "Ray's in the City"}, {"review": "I've visited other Ray's restaurants and find them to be consistently good. The one on Peachtree Street is very convenient when I stay at the Peachtree Plaza... just a 2-3 minute walk down the sidewalk. The food is excellent and the atmosphere sophisticated and upscale.", "time": "September 13, 2016", "author": "Jeanne H", "restaurant": "Ray's in the City"}, {"review": "My husband and I were greeted with a huge smile and knowledgeable server, Colin Williams who helped us navigate the menu. We got seated next to a wonder pianist that set the night off right. My husband ordered the double barrel Manhattan and I got a glass of red wine. We ordered today's cold water oysters and the dragon roll", "time": "September 8, 2016", "author": "Jenny W", "restaurant": "Ray's in the City"}, {"review": "Good tasted good, our waiter was nice and attentive. The hostess was terrible, I nicked named her bleak and miserable as she seated other diners. Not as expensive as I thought it would be, much smaller than u thought. It's weird because it seems to try to be a higher end restaurant but it doesn't feel like it. Overall, the", "time": "September 5, 2016", "author": "Desire s", "restaurant": "Ray's in the City"}, {"review": "Been here many times and over the years the price has gone up, the portions have gone down and the food quality has gone down. Sorry to see that it is not what it used to be.", "time": "September 4, 2016", "author": "LOUK194", "restaurant": "Ray's in the City"}, {"review": "We dined here on the Saturday night of DragonCon, when the area was simply insane! We made reservations at about 2:00 or 3:00 in the afternoon, and were given a time just fifteen minutes later than we requested. When we showed up about ten minutes late, because of heavy foot and elevator traffic, there were many people waiting for tables,", "time": "September 3, 2016", "author": "Andrew W", "restaurant": "Ray's in the City"}, {"review": "Ate here twice while in Atlanta on vacation. A little pricey but worth every penny. Ordered steak marinated with some sort of coffee can't remember clearly. The service is excellent. The food is mouth watering. The wine list-welcoming. Definitely the best of the best in the city.", "time": "August 31, 2016", "author": "kasusan", "restaurant": "Ray's in the City"}, {"review": "Ray's has been around for years and I think they act like it. In a city as hot as Atlanta and a real foodie city, one can not rest on being in the city as long as Ray's. While the quality of the food is good, staff must be more attentive to the promises made such as 30 minute wait,", "time": "August 29, 2016", "author": "jjeremys", "restaurant": "Ray's in the City"}, {"review": "I have to start with a commendation for our amazing server, Richard Shaw. He made sure that hubby's allergies were accounted for, and carefully and beautifully orchestrated our entire experience at Ray's. Because I'm originally from the south, and have been in Canada for so long, when I get a chance to eat great soul/southern cooking, I tend to go", "time": "August 27, 2016", "author": "BadKtty", "restaurant": "Ray's in the City"}, {"review": "Love the atmosphere and food. They always go out of their way to make sure we have a great time and that we love the food. They even let my daughter try oysters, when she did not like it, they gave her something else that she liked.", "time": "August 27, 2016", "author": "susanyoung004", "restaurant": "Ray's in the City"}, {"review": "Loved this restaurant decor and the food. The waitress Keely gave great recommendations and was very personable. Had a great time and will come back next time I'm in Atlanta.", "time": "August 27, 2016", "author": "marcia n", "restaurant": "Ray's in the City"}, {"review": "Had a very nice supper last night. We sat at the bar because the place was packed. Josh was our bartender/waiter and he was great! Super helpful, super friendly, and makes a fantastic martini. We also tried a chocolate martini that my wife immediately stole from me, and refused to share. The steak I had was cooked perfectly, and my", "time": "August 27, 2016", "author": "Michael M", "restaurant": "Ray's in the City"}, {"review": "I was so excited to try this restaurant. When I got there, it was around lunch time. Inside it is very nice. I sat in the front part of the restautant. I am not sure if the back part was opened for lunch hours but it was cool. I ordered a fried seafood platter. I received maybe three jumbo shrimp,", "time": "August 27, 2016", "author": "sejwar", "restaurant": "Ray's in the City"}, {"review": "Walked in around 9 pm while traveling solo and since the place was hopping (convention in town) they seated me at the oyster/sushi bar. The full menu was available, but since the fish that I wanted was sold out (good for them! popular entree...no points off from this reviewer as it was pretty late for dinner) I ordered their sashimi", "time": "August 24, 2016", "author": "doctorbchi", "restaurant": "Ray's in the City"}, {"review": "We had supper at this restaurant with a client. We were highly impressed with the ambiance, service and quality of food.\nWe decided to go back the following day for lunch. We were pleasantly surprised to have Keely as our waitress again. She pays attention to every detail and is an excellent professional. Congrats Keely. Keep up the good work.", "time": "August 23, 2016", "author": "lulubelas", "restaurant": "Ray's in the City"}, {"review": "The BBQ Shrimp with grit cake is to die for. I had it twice and it is awesome. Also had the lobster special 1 1/4 pound was also very very good. It was fresh and tasted great would recommend to anyone.", "time": "August 23, 2016", "author": "Suzon99", "restaurant": "Ray's in the City"}, {"review": "We made reservations for 2 about a week ahead of time. I specifically expressed that we wanted to hear some great jazz either during or after dinner. The lady on the phone told me that we could just move into the lounge after dinner. This was our first visit to this restaurant so I took her at her word. She", "time": "August 21, 2016", "author": "102Angela", "restaurant": "Ray's in the City"}, {"review": "I work in Atlanta once a year and I always eat at this restaurant~ I always have a good experience, the service and food are superb.", "time": "August 21, 2016", "author": "Lisa M", "restaurant": "Ray's in the City"}, {"review": "Stopped in for happy. Sandra, the Bartender, was amazing. The oysters and sushi are \"Must Haves\"! I said that I assent a Bourbon Fan. She made me a cocktail which changed my opinion of bourbon whisky.", "time": "August 19, 2016", "author": "Illinoius C", "restaurant": "Ray's in the City"}, {"review": "My waiter Marcel helped me to select lunch choices that exceeded my expectations. Not only was the presentation appealing to the eye the food was delicious and very satisfying. I topped off lunch with key lime pie, a favorite treat. Thanks Marcel for helping to make my dining experience memorable!", "time": "August 19, 2016", "author": "Gary H", "restaurant": "Ray's in the City"}, {"review": "I enjoyed a delicious birthday dinner at Ray's in the City about a week ago. Not only was the food outstanding, but the service was excellent. Taylor was our server- she was friendly, efficient, and very knowledgable about the menu. I was very impressed by her ability to constantly provide our table with what we needed before we ever had", "time": "August 16, 2016", "author": "corilutt", "restaurant": "Ray's in the City"}, {"review": "This restaurant was a little difficult to locate when coming from out of town, yet it was so well worth finding! Reservations were made online, the wait was short, the lines were long. The ambiance was perfect for our Anniversary celebration, and the menu and prices were great! Our server Jasmine was wonderful. We would definitely return to Ray's again", "time": "August 12, 2016", "author": "R. B", "restaurant": "Ray's in the City"}, {"review": "This place serves good food in a great downtown scene . We were here with family. The food was so good I became full and sleepy . The sign of goodness . Loved the chic environment.\nI sat right next to the fish tank with it beautiful fish. A new atlanta favorite for downtown seafood .", "time": "August 9, 2016", "author": "MAXWR", "restaurant": "Ray's in the City"}, {"review": "My husband and I were in Atlanta on a business trip and Rays in the city was recommended to us by several people. The restaurant was super busy so we decided to eat at the bar which is first come, first serve. We had the filet and scallops and both entrees were delicious! They also have a nice sushi menu.", "time": "August 6, 2016", "author": "islmom", "restaurant": "Ray's in the City"}, {"review": "Very nice restaurant experience in downtown Atlanta. Ate here twice in the same work week, both times at the bar. Very attentive servers and delicious food. Had a terrific trout dinner and a salmon lunch, both delicious. Good selection of local draft beers and a full bar. If you're in downtown ATL and looking for some good food, you can't", "time": "August 4, 2016", "author": "MMinFLA", "restaurant": "Ray's in the City"}, {"review": "This was quite simply an exceptional experience; everything from calling at the last minute and getting a table with Maria's help, to the great service provided by Brian to the outstanding food --- everything was first class. The Cesar salad was very good; the trout was excellent and the broiled seafood platter was top shelf.", "time": "July 30, 2016", "author": "WATIII", "restaurant": "Ray's in the City"}, {"review": "The menu is geared toward seafood, but they have sometime for everyone. The food is very good. We do business lunches here regularly.", "time": "July 30, 2016", "author": "David C", "restaurant": "Ray's in the City"}, {"review": "Great place for lunch. Pasta with shrimp special was great. Fried Goat cheese with sauce was also good. Lunch prices are reasonable..\nAtmosphere and service good.", "time": "July 29, 2016", "author": "baseballmom3_13", "restaurant": "Ray's in the City"}, {"review": "While in town for a work conference, a group of us teachers happened upon Ray's in the City while trying to escape a torrential downpour in downtown Atlanta! Boy, were we pleasantly surprised. The sushi was awesome, as was the prix fixe menu, pork chop, and other entrees enjoyed by our group. Our server, Chris Long, was informative, attentive, and", "time": "July 29, 2016", "author": "Angel B", "restaurant": "Ray's in the City"}, {"review": "I ate lunch at Ray's in the City in Atlanta yesterday. This is my favorite restaurant in the city! Their daily pasta choice is always excellent and is always plentiful enough to take half of it home for dinner! The service is awesome, the employees are friendly, and the managers always stop by the table to make sure everything exceeds", "time": "July 28, 2016", "author": "fkfad5", "restaurant": "Ray's in the City"}, {"review": "Standing outside the Mart, deciding about dinner and overheard us talking about Ray's. She said go - you will love it. We sure did. Service was excellent, food was awesome, can't wait to go back.", "time": "July 25, 2016", "author": "Martha202", "restaurant": "Ray's in the City"}, {"review": "My experience at this location was for a group, so think of this as a group experience. The food and drinks were great, staff were exceptionally nice and very professional. Although we had a large group, the temperature inside was less than ideal. This was my only complaint, I think looking passed all of that I left with a great", "time": "July 24, 2016", "author": "moodyj39", "restaurant": "Ray's in the City"}, {"review": "I went to Ray's last week and Chris Long was our server - he was the best! We had the best food, great drinks, and amazing service. I recommend trying Ray's for dinner, sushi or their regular menu are both great.", "time": "July 24, 2016", "author": "Kaitlyn M", "restaurant": "Ray's in the City"}, {"review": "Fantastic restaurant week menu and superb quality of food!! We were very impressed with the size of the offerings as well as the flavors!! The service and atmosphere were also excellent!! We enjoyed very much and look forward to dining here again!!", "time": "July 23, 2016", "author": "Kathy M", "restaurant": "Ray's in the City"}, {"review": "The food and drinks were delicious, the service was excellent, and the after dinner entertainment at the bar area was stellar. Our waiter, Bakary, took exceptional care of us. He made good suggestions re: dinner choices, he charmed us with his gregarious personality, and he answered questions we had about the area. He suggested the after dinner entertainment in the", "time": "July 19, 2016", "author": "jeffriem", "restaurant": "Ray's in the City"}, {"review": "Very busy, raining night and the table was ready at our appointed reservation time. All 4 of us at the table enjoyed the service and food. I had the filet and it was perfect and I mean just excellent in flavor, seasoning and tender as can be. Others at my table had the Shrimp and Grits and the fish of", "time": "July 18, 2016", "author": "ALEX P", "restaurant": "Ray's in the City"}, {"review": "When we go over to Atlanta for the Market, it is often too difficult (read that as \"I'm so very tired\" to get the car out and drive to a restaurant. Thankfully there is Ray's in the City within half a block. This place is not cheap, but the old adage \"you get what you pay for\" holds true. This", "time": "July 18, 2016", "author": "xsdv8", "restaurant": "Ray's in the City"}, {"review": "My friend and I have eaten here every year, for many years, whenever we are in town on business. This time, however, was a major disappointment. We arrived a bit early for a 7:30 reservation on a Friday. The place was packed as usual--no surprise there. We were seated promptly and ordered our usual--salmon oscar and sushi. Friend also ordered", "time": "July 17, 2016", "author": "Julie M", "restaurant": "Ray's in the City"}, {"review": "We went here after a conference and I thoroughly enjoyed it. The atmosphere was good, the service was great, the food and drinks were good. No complaints at all!", "time": "July 16, 2016", "author": "Raeven_11", "restaurant": "Ray's in the City"}, {"review": "We enjoyed our meal at Ray's - however, it is just an average meal. We did not have the best service. We did love the music by the bar and enjoyed listening to the singer.", "time": "July 12, 2016", "author": "Kelsey R", "restaurant": "Ray's in the City"}, {"review": "The food at Ray's is so well done, you can feel the love that went into the food. The service was not the absolute best, but it was lunch time and in a tourist area where they also get a lot of convention folks.", "time": "July 10, 2016", "author": "Brian P", "restaurant": "Ray's in the City"}, {"review": "We had a fantastic waiter, and since we had a large party they gave us the party room in the back...beautiful !! Great atmosphere\nScallops were great. I had salmon Oscar and loved it She crab bisque excellent\nAll staff was great!!", "time": "July 7, 2016", "author": "Lynne T", "restaurant": "Ray's in the City"}, {"review": "Wonderful food.\nHighly recommend the calamari appetizer.\nWe also had the salmon oscar...very tasty and well cooked.\nMy petit filet was ordered medium rare and was cooked exactly as ordered...which is hard to find. I was allowed to sub in a different side item in place of the mashed potatoes, which was much appreciated.\nWould definitely go again.", "time": "July 7, 2016", "author": "travelwarrior432", "restaurant": "Ray's in the City"}, {"review": "We went to Ray's in the City on Saturday night. They had live music. And you can enjoy the peaceful beauty of their aquarium as you dine. They offer half price bottles of fine wine after 6:00 on Saturday too. The food was fantastic! We can't wait to go again.", "time": "July 5, 2016", "author": "Kathy P", "restaurant": "Ray's in the City"}, {"review": "I went there for lunch on Saturday a party 5 without reservation, the front house lady was very professional and greeted us with a warm smile, without a word we were seated within 5 minutes. Service and food chicken and waffle was Excellent but the restaurant was very hot and stuffy,", "time": "July 3, 2016", "author": "tethm9", "restaurant": "Ray's in the City"}, {"review": "Five of us were all very pleased with our steak and seafood dishes ... But were most impressed with the excellent service. Very attentive, professional, and friendly (formal service but not stuffy). Highly recommend", "time": "July 2, 2016", "author": "Dan F", "restaurant": "Ray's in the City"}, {"review": "Service and food was excellent. It is a popular place so make a reservation. Great selection of seafood and steaks.\nWould recommend.", "time": "July 2, 2016", "author": "TCBinKC", "restaurant": "Ray's in the City"}, {"review": "I ate at this restaurant as part of a group dinner so our men options were limited but everything offered (salmon, steak and chicken) was very good. Vegetables were served family style and the brussel sprouts were particularly good. My only complaint is that it was very warm inside and unless you were seated by the fans, you would melt.", "time": "July 1, 2016", "author": "TheFiveTs", "restaurant": "Ray's in the City"}, {"review": "If you want seafood or steak while you're in downtown Atlanta; this is the place! Extensive wine menu and multiple regular seafood options in addition to their daily specials. It's within walking distance from most of the downtown hotels. Enjoy a night out and treat yourself at Ray's in the city!", "time": "June 28, 2016", "author": "mpivin", "restaurant": "Ray's in the City"}, {"review": "there for a group business dinner, surprised - everything from apps to desert was delicious and the staff was friendly and knowledgeable. great wines too.... will definitely stop again the next time I am in Atlanta.", "time": "June 27, 2016", "author": "lovetheparkcentral", "restaurant": "Ray's in the City"}, {"review": "We had dinner at Rays. Wonderful service, great food. Overall wonderful experience. The waiter was attentive and knowledgeable about the city and culture. Good stuff!", "time": "June 25, 2016", "author": "hhotstuff", "restaurant": "Ray's in the City"}, {"review": "Stopped by for lunch during a visit to Atlanta. The service was good and we had no complaints with the food. It was our first time at the restaurant and we were not disappointed. We weren't blown away but it's definitely worth a visit.", "time": "June 18, 2016", "author": "Mr G", "restaurant": "Ray's in the City"}, {"review": "Food was ok, but not anything I would go back for. The lobster was not very tasty and for $41 you would think it would be excellent not just mediocre.", "time": "June 16, 2016", "author": "Ken H", "restaurant": "Ray's in the City"}, {"review": "Nice choice for dinner in downtown Atlanta. Busy on a Sunday night. Went in for sushi and a beer. Small but adequate selection. Sushi was good, fresh and nicely presented. Service was slow and we had to ask for our drinks twice before they were delivered. All in all a good choice and would come back.", "time": "June 13, 2016", "author": "Hope L", "restaurant": "Ray's in the City"}, {"review": "This is an upscale restaurant with great service and well presented food. The lobster was very good and the bread basket was awesome!", "time": "June 12, 2016", "author": "artist2be", "restaurant": "Ray's in the City"}, {"review": "I dined here with a large group while at a conference. The service was wonderful. I had a salad, a seafood platter and a piece of cheesecake. The seafood platter was amazing: lobster tail, scallops, shrimp & salmon. All delicious, but the scallops were particularly good. I could have eaten a whole plate of just scallops and been happy. The", "time": "June 10, 2016", "author": "Buffy24", "restaurant": "Ray's in the City"}, {"review": "We were celebrating an anniversary and went to the Ga aquarium and stayed downtown to eat. We have tried several Ray's Restaurant but have never tried this one. Our waiter who was a GSU student from West Africa recommended the shrimp and grits for my wife and the horseradish encrusted grouper for me. He was \"spot on.\" For dessert he", "time": "June 5, 2016", "author": "dbsouth", "restaurant": "Ray's in the City"}, {"review": "I know there are plenty of good steak houses around Atlanta, and there are always going to be good and bad reviews of them all. This one may not be the best, but it was a great experience for us overall. The wait staff was excellent, the food was good and so was the atmosphere. So, if you are staying", "time": "June 3, 2016", "author": "squashblossom", "restaurant": "Ray's in the City"}, {"review": "The salmon sandwich was almost too thick to eat :-) Chips were great, food was great, even the drinks were great. It's a little crowded, not much room between tables. The guy next to me got up to leave and stood and talked for 5 minutes. I had his butt right by my head because there wasn't room for him", "time": "June 2, 2016", "author": "akadad", "restaurant": "Ray's in the City"}, {"review": "Leave the car at the hotel and stretch your legs in downtown Atlanta. Quiet atmosphere, great food, excellent service. Joseph was our waiter one evening in May 2016. I would recommend dropping by Rays In the City on every visit to ATL.", "time": "June 1, 2016", "author": "Suzanne C", "restaurant": "Ray's in the City"}, {"review": "This restaurant has a reputation for excellent seafood and it is deserved. I had the horseradish grouper and it was excellent. Lightly battered but with tons of flavor. My only complaint was that the lunch time wait staff was not as attentive as they should be. Drink refills had to be asked for and when the waiter forgot a requested", "time": "May 26, 2016", "author": "A C R", "restaurant": "Ray's in the City"}]