[{"review": "Great food and ambiance. Service was not up to typical standards. Repeatedly had to ask 2 or 3 times for refills of drinks or condiments.", "time": "2016-10-28", "author": "OpenTableUser2", "restaurant": "Blue Ridge Grill"}, {"review": "consistently all-star and outstanding, very high quality with both food, drink, and level of service-always exceptional", "time": "2016-10-26", "author": "RobR", "restaurant": "Blue Ridge Grill"}, {"review": "We have loved Blue Ridge Grill for over 20 years.  But, really, $62.00 for a steak?  Are you kidding?  The strip steak at BRG   is no better than the dry aged, prime strip steak you can buy at Whole Foods for $20.00.   We understand doubling the price but tripling it?  Sorry folks, but you've lost a loyal customer.", "time": "2016-10-25", "author": "OpenTable Diner Since 2013", "restaurant": "Blue Ridge Grill"}, {"review": "We all thoroughly enjoyed our meals; steak, salmon and lamb.  The service was excellent.  We were attending a show afterwards and they kept us on time without rushing.  A very pleasant experience.", "time": "2016-10-25", "author": "OpenTable Diner Since 2016", "restaurant": "Blue Ridge Grill"}, {"review": "Just bad! Will never take another client here again.", "time": "2016-10-25", "author": "OpenTable Diner Since 2016", "restaurant": "Blue Ridge Grill"}, {"review": "My husband and I had a wonderful time.  We were celebrating our wedding anniversary.  This was our first time dining at the Blue Ridge Grill.  I made the reservation thru Open Table and simply noted Wedding Anniversary.  To our surprise and joy our table was decorated and we received a complimentary dessert as well as our waiter, servers, etc., wished us a Happy Anniversary.  The food and service were both awesome I  can hardly wait to return.  Also be sure to check out the porch.  We sat there and had cocktails/wine before our dinner reservation.  The drink orders were taken when we sat down in the porch area and were excellent .The wine was also excellent and they had a great selection.   I highly recommend Blue Ridge Grill.", "time": "2016-10-24", "author": "Deedy", "restaurant": "Blue Ridge Grill"}, {"review": "We enjoyed our last visit, two weeks ago, so much that we made it a point to come back quickly.  The food is fantastic and the service is great also.  Thank you everyone for a great night!", "time": "2016-10-23", "author": "chefhelen", "restaurant": "Blue Ridge Grill"}, {"review": "Charming neighborhood feel but an upscale experience. Local trout was to die for, other standouts included the pork chop and the shrimp & grits.  Attentive but not overbearing service.   All in all, a gem", "time": "2016-10-22", "author": "AspiringFoodie", "restaurant": "Blue Ridge Grill"}, {"review": "Excellent service and  food. Exceeded expectations", "time": "2016-10-22", "author": "OpenTable Diner Since 2014", "restaurant": "Blue Ridge Grill"}, {"review": "The food was very good, although a little pricier than we remember.  Rog, our waitress, was wonderful.  We will definitely go back.", "time": "2016-10-22", "author": "Minnie", "restaurant": "Blue Ridge Grill"}, {"review": "Second visit to Blue Ridge Grill, and both times I've come away thinking it's solid, but nothing special. Overall, it's very similar to it's neighbor Houston's, but I would probably choose Houston's if I were picking between the two. \nThis visit, we started with a lobster bisque (special) and a salad, both of which were quite good, although the soup was a bit too rich (even for a bisque). The lobster sandwich is understandably small, and it's the type of thing that tastes great after one bite, but the more you eat, the more it just kind of tastes like butter. Which isn't entirely bad, but I split the sandwich and a burger with my wife, and I can't say I really wanted the other half of the lobster sandwich.  The burger was pretty average. \nService was quite good, although a bit stiff.", "time": "2016-10-21", "author": "Nickname", "restaurant": "Blue Ridge Grill"}, {"review": "I have been dining at the Blue Ridge Grill for over 20 years and admire the consistency in their presentations. The location is excellent and the décor is restful. The rest rooms are clean.\nService is a specialty, few places are better.", "time": "2016-10-21", "author": "OpenTable Diner Since 2014", "restaurant": "Blue Ridge Grill"}, {"review": "Had firm reservations through OT at 8:00. Was told that there was no table avail anytime soon and we would need to dine in the bar. Server approached the table (in the bar) by stating that they were all out of the specials (at 8:00). Food was good.", "time": "2016-10-20", "author": "OpenTable Diner Since 2014", "restaurant": "Blue Ridge Grill"}, {"review": "A wonderful dining experience with attentive and well paced service. Delightful experience!", "time": "2016-10-19", "author": "OpenTable Diner Since 2014", "restaurant": "Blue Ridge Grill"}, {"review": "Great spot - never disappoints. Food is always excellent and the service is impeccable, but never intrusive. A favorite.", "time": "2016-10-19", "author": "Jancecc", "restaurant": "Blue Ridge Grill"}, {"review": "The food was amazing, the service fantastic, and the atmosphere comfortable.  We will definitely return.", "time": "2016-10-15", "author": "CarolynL", "restaurant": "Blue Ridge Grill"}, {"review": "Consistently on point ! Fabulous service, excellent food prepared well with amazing ambiance\nMakes this a regular dining destination for me and friends to gather !", "time": "2016-10-14", "author": "OpenTable Diner Since 2014", "restaurant": "Blue Ridge Grill"}, {"review": "Always a special time of great food and friends. Wonderful service. Always a pleasure to go to Blue Ridge.", "time": "2016-10-10", "author": "ozwizard", "restaurant": "Blue Ridge Grill"}, {"review": "First time at Blue Ridge, which is hard to believe since I've been living in Atlanta for 4 years now.  But it was absolutely outstanding, both the food and the service.  Really enjoyed it... great place for a business lunch.", "time": "2016-10-05", "author": "Jimmy", "restaurant": "Blue Ridge Grill"}, {"review": "The service was very good and the food generally as well, but I ordered a very basic item (Springer Mountain chicken) which was served raw in the middle. Unfortunately, I didnt think the cut through the meat to check for doneness - didnt think I had to on a $30 entree - and probably ingested at least one bite of undercooked chicken. \nOur sever Roj was great and apologized profusely, they gave me something else very quickly, didnt charge for the entree and provided a complimentary dessert, which was the right thing to do. That being said, this was a wedding anniversary dinner at higher end restaurant and the chicken issue sort of spoiled the meal for me. Won't likely won't be returning here.", "time": "2016-10-02", "author": "OpenTable Diner Since 2007", "restaurant": "Blue Ridge Grill"}, {"review": "A longtime standby of ours. We dine here often and have celebrated birthdays, had business meetings, met friends for drinks, etc. They pull it off with great food and great service every time.", "time": "2016-10-01", "author": "ATLDiner", "restaurant": "Blue Ridge Grill"}, {"review": "Blue Ridge Grill is a \"10\" for fine dining, good food and great service!", "time": "2016-09-29", "author": "Connoisseur100", "restaurant": "Blue Ridge Grill"}, {"review": "Excellent experience - from the ambiance, to the food, to the service.  It was five star all the way.", "time": "2016-09-24", "author": "OpenTable Diner Since 2015", "restaurant": "Blue Ridge Grill"}, {"review": "Blue ridge is one of our favorites, a neighborhood gem.  However once in a while, it disappoints. Our server seem to be new and had no supervision. The trout was very disappointing.  It was covered with a buttery sauce which would have been fine served on the side. It would be a great dish with sautéed almonds on top rather than slathered in sauce.", "time": "2016-09-18", "author": "Nemos", "restaurant": "Blue Ridge Grill"}, {"review": "This restaurant not only has very good food, the service is excellent, and EVERYONE is extraordinarily pleasant.  I highly recommend the experience", "time": "2016-09-17", "author": "OpenTable Diner Since 2011", "restaurant": "Blue Ridge Grill"}, {"review": "Always a charming dinner and drinks on the weekend. Even into its 2nd decade this place stays delicious. The private rooms downstairs are a hidden gem. The front porch is the gathering spot for Southern ladies and gents.", "time": "2016-09-16", "author": "Foodieguy13", "restaurant": "Blue Ridge Grill"}, {"review": "fabulous ambiance-- relax on the porch with well-made drinks and unrushed service", "time": "2016-09-16", "author": "Meredith", "restaurant": "Blue Ridge Grill"}, {"review": "I dine at the Blue Ridge Grill often, frequently for business meetings as well.  I am always very well pleased with the ambiance, food, service, convenience and overall experience.  I would readily recommend the Blue Ridge Grill to other patrons.  Keep up the good work!", "time": "2016-09-13", "author": "OpenTable Diner Since 2016", "restaurant": "Blue Ridge Grill"}, {"review": "Seafood is delicious and highly recommended.  Love the lobster club", "time": "2016-09-12", "author": "JohnH", "restaurant": "Blue Ridge Grill"}, {"review": "I have eaten at this restaurant many times.  I have never had a disappointing meal.  The atmosphere is homey, the food is excellent quality and well prepared, and the service is always great.  We were pleased to see a new menu tonight which was larger and more diverse.  There were so many interesting items, it was hard to pick one.   When you want a nice relaxing meal, when you want to impress guests from out of town, or even a great business lunch, this restaurant always sets the standard for us.", "time": "2016-09-10", "author": "Xmaseve", "restaurant": "Blue Ridge Grill"}, {"review": "Always delicious!", "time": "2016-09-08", "author": "OpenTable Diner Since 2006", "restaurant": "Blue Ridge Grill"}, {"review": "Ben is and has always been super great!  Reads your need before you know it.  Great service", "time": "2016-09-08", "author": "LisaP", "restaurant": "Blue Ridge Grill"}, {"review": "Have dined there many times over the years for many occasions, and each time has been an exceptional experience.  Excellent food, wine list and cocktails,  and service.", "time": "2016-09-06", "author": "OpenTable Diner Since 2009", "restaurant": "Blue Ridge Grill"}, {"review": "Our second visit and we loved it again. It is a bit pricey but the food was delicious. Excellent service and a surprise birthday dessert for my husband. Very much enjoyed our visit.", "time": "2016-09-04", "author": "Swatkins", "restaurant": "Blue Ridge Grill"}, {"review": "Blue Ridge Grill offers the atmosphere of a rustic lodge with the menu of a classic American steakhouse. The wine list is offered on an iPad device. This was my first time seeing this method, but it was nice as it allowed a more in depth explanation of the wine offerings and this was helpful.\nThe lamb and steak were spectacular. Nice selection of seafood as appetizers and entrees as well. The meat was cooked as ordered, and the quality of the meat allowed for simple preparation. Side dishes were delicious as well. However, it is an ala carte menu so this can get pricey.\nIf you are in the mood for a classic steakhouse set in the feel of a mountain lodge, this is the Blue Ridge Grill.", "time": "2016-09-04", "author": "ChipP", "restaurant": "Blue Ridge Grill"}, {"review": "The meal was very nice, the waitress was very pleasant and it was a good evening.", "time": "2016-09-02", "author": "hungrydog", "restaurant": "Blue Ridge Grill"}, {"review": "Blue Ridge Grill is a well established  classy restaurant very good for any occasion.\nComfortable seating and space between the tables, polite service, good seating at the bar.\nThe wallet service is somewhat cramped for arriving space. \nFood is always at very good standard.", "time": "2016-09-01", "author": "OpenTable Diner Since 2014", "restaurant": "Blue Ridge Grill"}, {"review": "Always a great choice.  So many wonderful dishes, hard to choose.", "time": "2016-08-30", "author": "mariettaga", "restaurant": "Blue Ridge Grill"}, {"review": "EXCELLENT!  As always, never disappoints.  Friendly staff, awesome atmosphere, great service and food that has been awesomely consistent for the last 20 years I have been going here. It's what keeps me coming back again and again   Thank you Blue Ridge Grill - for excellent food, great times and endless memories", "time": "2016-08-28", "author": "OpenTable Diner Since 2016", "restaurant": "Blue Ridge Grill"}, {"review": "What a completely underwhelming experience. We had a friend in from out of town and we're looking forward to showing him a good time.  We were seated in the bar area which felt somewhat rushed and noisy.  The chairs were also very uncomfortable.  The lobster bisque was amazing. The $62 dry aged steak was bland and boring. The spinach and Mac and cheese sides were meh, average at best. The bone in ribeye was way overdone.  Our friend had the filet and enjoyed it, but overall, we spent $300 on a meal for 3 people which was average at best. I did tell our waiter, he offered me a free cocktail. Not the point at all. We dine out in Buckhead regularly, but next time I drop that much for a steak. It will be at Bones or Prime or somewhere else.", "time": "2016-08-27", "author": "OpenTable Diner Since 2005", "restaurant": "Blue Ridge Grill"}, {"review": "Service was amazing! Markens was spectacular and the birthday touches were extra special!", "time": "2016-08-27", "author": "OpenTable Diner Since 2006", "restaurant": "Blue Ridge Grill"}, {"review": "My husband and I met at BRG 4 years ago and we visit often, sometimes twice a week, to have dinner at the bar or with friends at a table.  We love the employees and always, always enjoy the food!", "time": "2016-08-26", "author": "Foodie", "restaurant": "Blue Ridge Grill"}, {"review": "Our server went out of her way to keep us on schedule.  We arrived late due to traffic and had to leave to go to a meeting at our daughter's school.  Our server got our good out on time and wrapped part of it up to go so that we would not be late.  I love great service and great food and Blue Ridge Grill has both!", "time": "2016-08-24", "author": "OpenTable Diner Since 2009", "restaurant": "Blue Ridge Grill"}, {"review": "My friends and I recently had another great meal at the Blue Ridge Grill.  There is no better restaurant in Atlanta to celebrate a birthday!  When you have excellent food, service and ambience and they go the extra mile for a special occasion there's no need to go anywhere else.", "time": "2016-08-24", "author": "Silverspoon", "restaurant": "Blue Ridge Grill"}, {"review": "The food is always wonderful ! The service is fabulous. Never disappoints.", "time": "2016-08-20", "author": "ozwizard", "restaurant": "Blue Ridge Grill"}, {"review": "It has been better. The prime rib was mostly fat. Wine list was excellent but cab was served \"cold\".  Fridge cold.", "time": "2016-08-14", "author": "OpenTable Diner Since 2013", "restaurant": "Blue Ridge Grill"}, {"review": "It was our 50th wedding anniversary and we had 15 ppl plus 4 children under 4. Everything was perfect including the wait staffs attention to the kids. Their food was brought out with our appetizers/salads so the kids were occupied during the meal. (Very thoughtful)!\nThe Blue Ridge salad was exceptional as were the steaks, lamb chops, trout and the vegetarian plates. I can't forget the sides of Mac n cheese, corn soufflé and the mashed potatoes. Yum! \nWe will definitely return!", "time": "2016-08-14", "author": "Artsysue", "restaurant": "Blue Ridge Grill"}, {"review": "Liked the Blue Ridge Grill from the moment I walked in the door.  Service was outstanding, décor was great and the food was excellent.  Coming back for more soon.", "time": "2016-08-12", "author": "ElnoraJ", "restaurant": "Blue Ridge Grill"}, {"review": "The service is amazing  the food is even better.   Rog is an awesome waitress ask for her!", "time": "2016-08-10", "author": "OpenTable Diner Since 2006", "restaurant": "Blue Ridge Grill"}, {"review": "The area where we were seated was very loud; I could not hear my table mates. Next time, I will request a table in the lower area near the fire place. Thx.", "time": "2016-08-09", "author": "Judd", "restaurant": "Blue Ridge Grill"}, {"review": "From the moment we walked in until the time we left everything was top notch! Our server Whitni was fabulous and helped answer any question we had and provided great recommendations!  Our food was extremely good. The nice touch for my 2nd mom's birthday was such a great and heartfelt gesture.  I would recommend Blue Ridge Grill to everyone I know!", "time": "2016-07-30", "author": "Ace2013", "restaurant": "Blue Ridge Grill"}, {"review": "Outstanding in every way possible!", "time": "2016-07-30", "author": "Diner", "restaurant": "Blue Ridge Grill"}, {"review": "I was a bit disappointed in this meal. I love the Blue Ridge Grill . BUT the salad I had was small, not much chicken  and the lettuce not fresh . I have had better meals there in the past. I would think twice about going there again for lunch or getting that particular salad. \nNot up to par.", "time": "2016-07-29", "author": "particular", "restaurant": "Blue Ridge Grill"}, {"review": "Food is excellent as is service. Moderately expensive considering meal was luncheon, with 1 alcoholic beverage, no side salads or appetizers, and one desert. Atmosphere extremely pleasant. Noise level sufficient low to have conversation with luncheon partner(s) without strain - something which seems to be a rarity these days.", "time": "2016-07-28", "author": "iberiansow", "restaurant": "Blue Ridge Grill"}, {"review": "Excellent food and excellent service.", "time": "2016-07-28", "author": "OpenTable Diner Since 2013", "restaurant": "Blue Ridge Grill"}, {"review": "Very good food and service, as always. We were in for lunch and in a bit of a hurry to make a meeting. Whitney took note of that and made it happen.", "time": "2016-07-27", "author": "Jack", "restaurant": "Blue Ridge Grill"}, {"review": "It was my birthday and they made me feel welcome and very special. From check in to the waitress and server assistance was great. Table and menu were personalized for my birthday. Special dessert was beautiful and delicious.\nThe service and the welcome made for a great night", "time": "2016-07-27", "author": "bobh", "restaurant": "Blue Ridge Grill"}, {"review": "We go to Blue Ridge Grill occasionally. We planned to have a nice leisurely lunch for a change of pace. Our waiter was especially pleasant and attentive. The food was delicious, and we look forward to going back soon!", "time": "2016-07-26", "author": "LisaH", "restaurant": "Blue Ridge Grill"}, {"review": "The Blue Ridge Grill never disappoints.  The food  and  service is always exceptional.", "time": "2016-07-25", "author": "LisaI", "restaurant": "Blue Ridge Grill"}, {"review": "Always enjoyable - great food and the service is always outstanding.", "time": "2016-07-23", "author": "cameronj", "restaurant": "Blue Ridge Grill"}, {"review": "Our experience at Blue Ridge Grill was excellent!\nRegarding Open Table, I anticipated receiving 1000 points and received confirmation for 100.  No big deal or problem but worth mentioning.", "time": "2016-07-23", "author": "CynthiaK", "restaurant": "Blue Ridge Grill"}, {"review": "Excellent meal as always.  Service was very good with seating immediately on reservation time and table request honored.  Delicious lobster bisque and lamb chop.   The pecan pie with cinnamon ice cream was a nice way to end the meal.", "time": "2016-07-23", "author": "Dine30319", "restaurant": "Blue Ridge Grill"}, {"review": "Fantastic night with friends. The staff was excellent and Jeff our waiter was efficient, friendly, and had a great sense of humor.\nThe food was good. The ambience was spectacular,we had a private area.\nDefinitely will be back!", "time": "2016-07-23", "author": "Yummy", "restaurant": "Blue Ridge Grill"}, {"review": "At the top of our list every time we are in Atlanta!", "time": "2016-07-23", "author": "Sissy", "restaurant": "Blue Ridge Grill"}, {"review": "We LOVE Blue Ridge Grill and visit often.  I would recommend it to anyone wanting a great meal with good service and menu choices.", "time": "2016-07-22", "author": "rtwoods", "restaurant": "Blue Ridge Grill"}, {"review": "Very wonderful experience.  Our waiter was excellent.  Reminded us of our past dining at the Four Seasons in Manhattan in New York.", "time": "2016-07-20", "author": "TedW", "restaurant": "Blue Ridge Grill"}, {"review": "We had an excellent dinner at Blue Ridge Grill.  It is consistently good.", "time": "2016-07-20", "author": "Suzanne", "restaurant": "Blue Ridge Grill"}, {"review": "Never disappoints. Food and service always impeccable.", "time": "2016-07-19", "author": "Jancecc", "restaurant": "Blue Ridge Grill"}, {"review": "Very expensive even by Atlanta standards. There are a 100 other restaurants I would choose for a $200 per couple dining experience.", "time": "2016-07-18", "author": "Elvis56", "restaurant": "Blue Ridge Grill"}, {"review": "This is such a nice venue whether for dinner or drinks. It never disappoints and the service is fantastic.", "time": "2016-07-16", "author": "Foodie64", "restaurant": "Blue Ridge Grill"}, {"review": "Great food, service and ambience, plus a good value", "time": "2016-07-16", "author": "rexdad", "restaurant": "Blue Ridge Grill"}, {"review": "This is one of out favorite restaurants and I've eaten there many times.  The food is always consistently very good... and tonight was right on par! \nOur waiter was Markens and he was exceptional!  Very knowledgeable of the menu and wine list, polite and friendly and on top of the everything without being intrusive. I've eaten in many of the top restaurants in the major cities of the world over the years and his service was as good as I've ever had.  \nSo I definitely recommend this restaurant and, if you can, ask for Markens.  The food and especially the service will be notable.", "time": "2016-07-15", "author": "OpenTable Diner Since 2006", "restaurant": "Blue Ridge Grill"}, {"review": "Amazing experience great food, professional and friendly staff highly recommend and will continue to come back.", "time": "2016-07-14", "author": "OpenTable Diner Since 2014", "restaurant": "Blue Ridge Grill"}, {"review": "Best place I have ever been for a birthday dinner celebration! The menu was decorative and said \"Happy Birthday\", there was Happy Birthday confetti moderately decorating our table and my husband received a free dessert. Couldn't have been more special for him!", "time": "2016-07-12", "author": "GayeP", "restaurant": "Blue Ridge Grill"}, {"review": "Great service. \nHard to seat 8 except in the bar area\nFood very good but expensive\nSides have to be ordered separately\nGreat ambiance", "time": "2016-07-09", "author": "Marsh", "restaurant": "Blue Ridge Grill"}, {"review": "Everything was marvelous from start to finish. The hostess greeted us warmly. Our server, John, was spectacular!  He was very attentive and helpful with menu selections. John's warm, witty, friendly, and gregarious personality helped to make the birthday celebration outstanding. The food was absolutely exquisite and cooked to perfection.  The birthday dessert was a delight!  We had a wonderful culinary experience at Blue Ridge Grill!!", "time": "2016-07-08", "author": "MeMe", "restaurant": "Blue Ridge Grill"}, {"review": "Everyone at Blue Ridge Grill provides impeccable service and I have begun taking girlfriends there for their birthdays. They fuss over them royally. My family and I have been loyal fans of this restaurant for years and have always felt the food to be delicious and the overall experience is always extremely positive and memorable.", "time": "2016-07-08", "author": "Jancecc", "restaurant": "Blue Ridge Grill"}, {"review": "Outstanding meal & delightful occasion in every way.", "time": "2016-07-07", "author": "Mary", "restaurant": "Blue Ridge Grill"}, {"review": "John, our server, was amazing!  Kudos to him for outstanding service.", "time": "2016-07-07", "author": "Shopgirlnola", "restaurant": "Blue Ridge Grill"}, {"review": "Celebrating a friends birthday.  Table was decorated and menus personalized.  Great touch!  Service and food were impeccable!  Loved the experience!   Kandy MacCarthy", "time": "2016-07-06", "author": "KandyM", "restaurant": "Blue Ridge Grill"}, {"review": "Our fave! it was the perfect spot for a birthday celebration!", "time": "2016-07-05", "author": "neighbor", "restaurant": "Blue Ridge Grill"}, {"review": "Romantic setting tucked away in the outskirts of Buckhead.  Amazing menu.  Great service.   Attentive staff.  I ate the swordfish and it was amazing.   This is my new favorite dish.", "time": "2016-07-04", "author": "HoneyCrystalD", "restaurant": "Blue Ridge Grill"}, {"review": "Awesome restaurant , food is great and sit staff are courteous and prompt.", "time": "2016-07-02", "author": "NancyH", "restaurant": "Blue Ridge Grill"}, {"review": "Two minor things. \nAlmost every time I go to the Blue Ridge Grill, there seems to be a small problem with getting seated. There is usually a delay, a nose wrinkling by the host, then a sigh (all while looking at the computer monitor) and then finally you are headed to your table. It just does not seem like the host is happy you are there. There is never a nice, positive response of, \"Yes, I have your reservation here.\"\nI ordered the chicken and it was very good. But, the very thinly sliced fries were hard to eat. They were hard to eat with a fork and I didn't want to use my hands. Good flavor and good presentation, but difficult to eat.", "time": "2016-06-30", "author": "BuddyinVinings", "restaurant": "Blue Ridge Grill"}, {"review": "Late Sunday night dining after a Broadway show at the Fox. Food was great as usual and the experience was excellent!", "time": "2016-06-27", "author": "HomeRentalPro", "restaurant": "Blue Ridge Grill"}, {"review": "This restaurant has been in ATL for years and for some reason we have never been. We had a change of plans and need a last minute reservation for 8. They were able to accommodate and the food and atmosphere was wonderful. We were so pleased and will certainly be returning!", "time": "2016-06-25", "author": "OpenTable Diner Since 2013", "restaurant": "Blue Ridge Grill"}, {"review": "I can only rate the food as good.  My steak was a bit under cooked.  Most of my party really enjoyed the experience but as I was paying for it I say it is a bit over priced considering the overall quality.  Our service was well above average.  This is a very good restaurant.", "time": "2016-06-25", "author": "COLW", "restaurant": "Blue Ridge Grill"}, {"review": "We've been BRG patrons since it opened. Can't say enough about the service! Perfect! The maitre d 's always perfect!  Even the valet guys whom we've gotten to know are......perfect!  If we have anything to share it's that the strip steaks are hit or miss.  Sometimes awesome and other times tasteless. Undependable.  The main thing we'd LOVE to see are better sides.  We have always thought the sides are kind of an afterthought. Thanks for allowing us to share.", "time": "2016-06-25", "author": "OpenTable Diner Since 2013", "restaurant": "Blue Ridge Grill"}, {"review": "My wife and I were there early (5:30pm) celebrating our wedding anniversary. The atmoshere was quiet and friendly. Good food and prompt, attentive service. Love the ambiance of the cabin.", "time": "2016-06-25", "author": "JimC", "restaurant": "Blue Ridge Grill"}, {"review": "The atmosphere was rustic but refined, classy yet comfortable.  The food was healthy and delicious.  The service was impeccable, and they made my birthday special.  Try to seared scallops - heavenly!", "time": "2016-06-23", "author": "EatWell", "restaurant": "Blue Ridge Grill"}, {"review": "One of our favorite restaurants ever. Great food, old fashioned service. Reasonable prices for the quality. Could not recommend more highly.", "time": "2016-06-21", "author": "GarlandP", "restaurant": "Blue Ridge Grill"}, {"review": "Our food was perfect, except the Macaroni and Cheese, it was dry and not good tasting.  My waiter got them to make me Crème Brule and it was absolutely wonderful.  Made my birthday very special.   This was the first time I have brought my family there, I usually come with clients and as a client.   It was a good experience.  My waiter was wonderful.", "time": "2016-06-20", "author": "BetsyC", "restaurant": "Blue Ridge Grill"}, {"review": "Blue Ridge Grill is  a beautiful restaurant with great ambiance.  We had a reservation and were seated very close to the reservation time.  The service was phenomenal!  John took great care of us throughout our lunch however, the brunch food wasn't all that was expected.  I ordered the Eggs Benedict and asked for the hollandaise on the side.  I am glad that I did since the eggs weren't hot and the hollandaise had become clumpy.  Also, the side of grits we ordered were good but the red-eyed gravy was a very small serving and not very \"red-eyed\".  It was a busy day there as it was Father's Day, but I was a bit disappointed in the temperature of the food.\nI do look forward to dong to Blue Ridge Grill in the future as it is a gem of a restaurant.", "time": "2016-06-19", "author": "OpenTable Diner Since 2008", "restaurant": "Blue Ridge Grill"}, {"review": "We went to the Blue Ridge Grill for Father's Day brunch.  The food was amazing, the atmosphere warm and comfortable.  This restaurant could really have been in Blue Ridge.  We will be back to try some of their amazing salads for lunch and sample the dinner menu!", "time": "2016-06-19", "author": "smitty1965", "restaurant": "Blue Ridge Grill"}, {"review": "Had brunch with my family here and it was great, they took good care of us and we were especially needy with 3 kids.  I was a bit disappointed in the fried chicken, I've had much better in ATL, but the sides were amazing and everyone loved the pancakes!  We will certainly return for brunch, great experience dining with our family!", "time": "2016-06-19", "author": "ATLgirl370", "restaurant": "Blue Ridge Grill"}, {"review": "Excellent service.  3 out of 4 dishes amazing, the eggplant entree lacked flavor, the seabass , lamb and steaks were excellent!) great place for grown ups.  Def coming back.", "time": "2016-06-18", "author": "NellieInATL", "restaurant": "Blue Ridge Grill"}, {"review": "Corn soufflé cannot be beat anywhere. The food is always excellent. Waiters have excellent knowledge of the wines and the menu items. \nIf I could change one thing it would be to update more of their dishes.", "time": "2016-06-18", "author": "MotoMan", "restaurant": "Blue Ridge Grill"}, {"review": "Always excellent", "time": "2016-06-16", "author": "OpenTable Diner Since 2006", "restaurant": "Blue Ridge Grill"}, {"review": "I took a friend to lunch for her birthday / business meeting.  We were greeted with Happy Birthday the hostess and wait staff all greeted me with my name even though they did not know me and wished my friend birthday greetings.  When we were shown our table it was decorated with confetti and chocolate kisses which was so unexpected we were both touched.  The Lobster Cobb salad was a de-constructed wonder and delicious.  And a dessert for the birthday girl was absolutely amazing.  and they sent the second half home with her.  This was not just a wonderful lunch, it was a mini party.  It certainly made me look good and my friend extremely happy.", "time": "2016-06-14", "author": "NancyF", "restaurant": "Blue Ridge Grill"}, {"review": "Always top rate service and everyone is very professional.  Food is delicious but portions seem to be somewhat on the small end and it's a bit pricey.  Perfect spot for a client lunch.", "time": "2016-06-13", "author": "gojackets11", "restaurant": "Blue Ridge Grill"}, {"review": "Service was very good, timely, until the very end.  Maybe Aubrey wanted to give us time to talk after dinner, not sure, just seemed like a long time from dessert (which took long because apparently something happened to the first one...no problem, BRG did not charge for it, nice gesture) until Aubrey reappeared, at which point the check arrived quickly.  Just need a little check-in there to see where things stand...I would have said just bring the check when you get a chance.  But Aubrey was good, do not misunderstand.  Always enjoy BRG.", "time": "2016-06-11", "author": "ViningsGuest", "restaurant": "Blue Ridge Grill"}, {"review": "Good place to share and decent wine list without being too over the top.", "time": "2016-06-11", "author": "peblack", "restaurant": "Blue Ridge Grill"}, {"review": "We had never been to the Blue Ridge Grill before but we were very impressed and we will be back !  It was a wonderful experience from all angles.  The service was impeccable and we just don't see the attention to customers and detail like that much anymore.\nAll the food was amazing ........from the irresitable bread to the decadent dessert. \nWe could not have been happier and we will be back soon. We have already told several friends about it.", "time": "2016-06-11", "author": "Julie66", "restaurant": "Blue Ridge Grill"}, {"review": "Very professional staff, complementary valet, and food was delicious.  I can't wait to go again!", "time": "2016-06-11", "author": "Myfave", "restaurant": "Blue Ridge Grill"}, {"review": "Had a great meal on a relatively quiet Friday night. Service was outstanding - attentive without hovering over the table. The oysters started off the evening in grand fashion. The steak and scallops we ordered were prepared to order and delicious. Although the restaurant was not quite full to capacity, the vibe of this special place was still present.  You should come here expecting a great meal, outstanding service, and lots of vibe. You won't be disappointed.", "time": "2016-06-10", "author": "GaTraveler", "restaurant": "Blue Ridge Grill"}, {"review": "An overall nice experience and ambiance. Welcoming and knowledgeable staff. The pork chop dish and accompanying mashed potatoes were superb. The crab cake appetizer was underwhelming and disappointing. The overly thick crust overwhelmed the filling on the banana cream pie.", "time": "2016-06-10", "author": "OpenTable Diner Since 2015", "restaurant": "Blue Ridge Grill"}, {"review": "Without a doubt, the Blue Ridge Grill is a neighborhood gem and sets the standard when it comes to great food and impeccable service.  We were respectfully greeted by the maitre d who promptly seated us and provided us with a great table for lunch.  The wait staff were attentive, providing just the right amount of care without making us feel rushed.  \nOur food was exceptional in both quality and presentation and was served at the the right time and temperature.  We will be back!", "time": "2016-06-09", "author": "culinarycrusader", "restaurant": "Blue Ridge Grill"}, {"review": "Great service beginning with the valet service.  Very welcoming staff.", "time": "2016-06-08", "author": "OpenTable Diner Since 2013", "restaurant": "Blue Ridge Grill"}, {"review": "Food is excellent, service is impeccable. Highly recommend.", "time": "2016-06-08", "author": "BarryM", "restaurant": "Blue Ridge Grill"}, {"review": "Very upscale dining experience contrary to what the outside appearance may make you think. Definitely a 5 star dining experience with a price to match, worth every penny.", "time": "2016-06-06", "author": "OpenTable Diner Since 2010", "restaurant": "Blue Ridge Grill"}, {"review": "Ben is the best bartender ever!!!", "time": "2016-06-04", "author": "OpenTable Diner Since 2012", "restaurant": "Blue Ridge Grill"}, {"review": "Our waiter Rog was fantastic! We had just started a girls vacation and  the bar was set very high by Rog. We have not had as great service since. Let us eat a leisurely meal no rush", "time": "2016-06-03", "author": "MegH", "restaurant": "Blue Ridge Grill"}, {"review": "Our waiter was outstanding, as was the food. It is my favorite restaurant, hands down. Everything was wonderful except the noise level was so, so loud, we couldn't hear each other talk. That is a major annoyance when paying a significant amount of $$ for a pleasant dining experience.", "time": "2016-06-01", "author": "OpenTable Diner Since 2016", "restaurant": "Blue Ridge Grill"}, {"review": "great meal on to be enhanced by the excellent waitress re had", "time": "2016-06-01", "author": "HJ27", "restaurant": "Blue Ridge Grill"}, {"review": "Made reservations celebrating my wife's birthday.  The staff greeted her by name upon arrival and prepared a special table with confetti and a personalized menu!  We were blown away!", "time": "2016-05-29", "author": "OpenTable Diner Since 2012", "restaurant": "Blue Ridge Grill"}, {"review": "Great food and service but way overpriced food and somewhat the wine. I can get the same quality food, wine, and service for 30% less elsewhere.  $200 for two courses  for 2 with wine is unsat.", "time": "2016-05-28", "author": "Terry", "restaurant": "Blue Ridge Grill"}, {"review": "THE MOST AWESOME HIDDEN JEWEL RESTAURANT IN ATLANTA !!!!!!!!!!!!!!!", "time": "2016-05-28", "author": "Prophet", "restaurant": "Blue Ridge Grill"}, {"review": "Great food & staff. Overall great dining experience. We will definitely go again.", "time": "2016-05-26", "author": "OpenTable Diner Since 2013", "restaurant": "Blue Ridge Grill"}, {"review": "My favorite restaurant for pleasure or business.  Food and service is consistently good.  Love their steak and fish menu items/specials ---great crab cake and the corn soufflé is a must.", "time": "2016-05-26", "author": "Steakfoodie", "restaurant": "Blue Ridge Grill"}, {"review": "The service was excellent and the food very good.  Both the waitstaff (including busboys and others) and the bartenders were genuinly friendly and helpful.\nEnjoyed a really nice dinner with my wife.", "time": "2016-05-21", "author": "OpenTable Diner Since 2015", "restaurant": "Blue Ridge Grill"}, {"review": "Blue Ridge Grill has been among our favorite restaurants since it opened. The food, service, ambiance never fail us. We'll be back, and back, and back.", "time": "2016-05-21", "author": "OpenTable Diner Since 2008", "restaurant": "Blue Ridge Grill"}, {"review": "My family and I were treated like royalty. It was a birthday celebration for us and the staff and management at Blue Ridge exceeded all our expectations!  Thank you, Blue Ridge Grill for another delicious and delightful experience", "time": "2016-05-21", "author": "OpenTable Diner Since 2015", "restaurant": "Blue Ridge Grill"}, {"review": "have been here a few times (and recently has become one of our go-to spots) and have never been disappointed.   Starting with warm bread and continuing thru appetizer, main course, coffee and desert the food is tasty and well-presented and sized correctly.  We enjoyed a nice wine as well.  Never felt hurried.  Without a doubt we're coming back.", "time": "2016-05-20", "author": "OpenTable Diner Since 2010", "restaurant": "Blue Ridge Grill"}, {"review": "Always perfect!. The food, the service... You can never go wrong with a visit to the Blue Ridge Grill.", "time": "2016-05-19", "author": "OpenTable Diner Since 2009", "restaurant": "Blue Ridge Grill"}, {"review": "Everything was handled very professionally.  The food was good and we were all treated very well.", "time": "2016-05-16", "author": "Carolyn", "restaurant": "Blue Ridge Grill"}, {"review": "This lunch was for a business gathering.  Food was excellent as expected.  Peak dining times are noisy but we could hear each other.  Our waitess was great.  Try the lunch vegetable plate and don't miss the corn casserole.", "time": "2016-05-16", "author": "Hummm", "restaurant": "Blue Ridge Grill"}, {"review": "My husband and I love having dinner at the bar!  Brian and his fellow colleagues are superbly talented, all the drinks are perfect, and they're funny, friendly, and provide impeccable service.  We love living in this area of Atlanta because we're so close to one of our most favorite spots in the city!!", "time": "2016-05-15", "author": "Foodie", "restaurant": "Blue Ridge Grill"}, {"review": "Wedge salad: very few bacon bits & tomato. Poor dressing  so we ordered blue cheese dressing.\nHad spare ribs -quite good.\nSorry you have a corkage fee on wine", "time": "2016-05-15", "author": "jenn", "restaurant": "Blue Ridge Grill"}, {"review": "This was the best lobster bisque ever!  The bread is fantastic, crusty on the outside, soft inside.  The service was so good I thought I was on a cruise.", "time": "2016-05-14", "author": "OpenTable Diner Since 2013", "restaurant": "Blue Ridge Grill"}, {"review": "I noted on OpenTable that we were celebrating our anniversary, and they decorated our table with confetti and kisses, had special menus printed and laminated with hearts and Happy Anniversary on it, and offered us free champagne OR a free dessert. The service was exceptional, and they even took our picture and offered to print it out for us (but then discovered that service only worked for iphones, whereas we have android phones). My husband's steak was the BEST he ever had, and the entire experience was enjoyable. Best ever!", "time": "2016-05-14", "author": "OpenTable Diner Since 2015", "restaurant": "Blue Ridge Grill"}, {"review": "Service was stellar!", "time": "2016-05-14", "author": "OpenTable Diner Since 2014", "restaurant": "Blue Ridge Grill"}, {"review": "Love this place. It's a lunchtime winner! Please, give it a try.", "time": "2016-05-12", "author": "FMGM3", "restaurant": "Blue Ridge Grill"}, {"review": "This was my second time at Blue Ridge Grill.  It is a nice place in the area.  Both times I was there, the service was wonderful.  The first time my meal was ok/good (duck pot pie) and this time my steak was a very nice NY Strip.  I do expect a little better quality of this area and at his price range.  My colleagues all enjoyed it.", "time": "2016-05-11", "author": "OpenTable Diner Since 2014", "restaurant": "Blue Ridge Grill"}, {"review": "Great Mother's Day dining experience.", "time": "2016-05-08", "author": "mjrider", "restaurant": "Blue Ridge Grill"}, {"review": "On a very busy Mother's Day we had a great brunch and service to match", "time": "2016-05-08", "author": "Lulubell", "restaurant": "Blue Ridge Grill"}, {"review": "Our server, Matt, was awesome. Fast, knowledgable, friendly (but not TOO friendly)... The food was delicious and do were the drinks we ordered! Best part: they had a separate gluten free menu! It makes it SO much easier on me and my poor server to have a separate menu!! Would definitely return!", "time": "2016-05-08", "author": "OpenTable Diner Since 2012", "restaurant": "Blue Ridge Grill"}, {"review": "on a level from 0ne to ten. It was definitely a ten.", "time": "2016-05-08", "author": "Unhappy", "restaurant": "Blue Ridge Grill"}, {"review": "Visited with wife and son for a combined Mothers Day and our Anniversary- \nFood was absolutely great and enjoyed by the three of us.\nServers struggled with seating set up in that area however.", "time": "2016-05-08", "author": "Jeff", "restaurant": "Blue Ridge Grill"}, {"review": "I have recently discovered Blue Ridge Grill and now am a weekly visitor! I have dined in Atlanta for over 20 years before discovering the Greatest culinary experience in Atlanta. \nIt is extraordinary! Food, Service, Ambiance it has it all.", "time": "2016-05-07", "author": "Prophet", "restaurant": "Blue Ridge Grill"}, {"review": "I had the duck pot pie and it was incredible.  The tuna tartar app was also delicious.", "time": "2016-05-06", "author": "OpenTable Diner Since 2015", "restaurant": "Blue Ridge Grill"}, {"review": "The food is exceeded only by the level of the service. Great food is served by an efficient capable staff in a beautiful setting. Everything about Blue Ridge Grill is superb!", "time": "2016-05-06", "author": "CathyC7", "restaurant": "Blue Ridge Grill"}, {"review": "We had a great meal and they really made it special for our daughter's birthday .  She has to avoid gluten and they were knowledgable and friendly in accommodating that.", "time": "2016-05-01", "author": "OpenTable Diner Since 2013", "restaurant": "Blue Ridge Grill"}, {"review": "We found BRG on Open Table and it was our first visit, but it will not be our last!    From the personal touch of the greeter knowing our name upon our arrival, to our attentive server, everything was great from start to finish (food included)!", "time": "2016-05-01", "author": "KJH15", "restaurant": "Blue Ridge Grill"}, {"review": "Always great service and food.  The \"lodge\" atmosphere makes for terrific ambience.", "time": "2016-04-30", "author": "Suzy", "restaurant": "Blue Ridge Grill"}, {"review": "It was our 43rd wedding anniversary, and the Blue Ridge Grill made the evening fantastic. The food was great, the service was great (we even had specially printed menus and a decorated booth, both surprises), and the ambience was great. You can't go wrong here.", "time": "2016-04-28", "author": "SandySpringsGoose", "restaurant": "Blue Ridge Grill"}, {"review": "Blue Ridge is our favorite Atlanta restaurant.  The restaurant is beautifully decorated; the service is perfect (attentive but never annoying like Buckhead Life); the food is superb.  There is only ONE Blue Ridge Grill and Atlanta is lucky to have it!  I always recommend it to out-of-town guests.", "time": "2016-04-26", "author": "catlady", "restaurant": "Blue Ridge Grill"}, {"review": "Food was good without being great. We went for lunch. No problems with the service. Expected more for the money.", "time": "2016-04-26", "author": "OpenTable Diner Since 2012", "restaurant": "Blue Ridge Grill"}, {"review": "Great food, great service, and great atmosphere.  This was our first time here and we were not disappointed.  I'd recommend Blue Ridge Grill.  We look forward to visiting again in the future.", "time": "2016-04-23", "author": "OpenTable Diner Since 2016", "restaurant": "Blue Ridge Grill"}, {"review": "The service at BRG is professional and courteous, subtly reminding you that you are in a nice restaurant. Out waiter, Dean, did an outstanding job tending to our large group. Our table was decorated for the birthday we were celebrating. The food was amazing (tuna tartar, trout, filet, lamb chops, short ribs, and Bronzino), and the Mac and cheese is one of the best I've ever had. This was a special night and BRG was a great host.", "time": "2016-04-23", "author": "fashfamily", "restaurant": "Blue Ridge Grill"}, {"review": "My husband and I celebrated our 11th year of marriage at Blue Ridge Grill and we couldn't have been happier with our experience.  Our food was fantastic! My husband especially loved his quail appetizer. The service was top notch. Upon arrival I was greeted by name and wished a happy anniversary.  The staff really went above and beyond to make this a memorable evening for us.", "time": "2016-04-23", "author": "OpenTable Diner Since 2012", "restaurant": "Blue Ridge Grill"}, {"review": "Great ambiance, great service!  The ribeye was fantastic!", "time": "2016-04-22", "author": "OpenTable Diner Since 2011", "restaurant": "Blue Ridge Grill"}, {"review": "We love the Blue Ridge Grill! Such good food and service! They always remember us by name and seat us in our favorite booth! Not many restaurants in this busy city show this type of hospitality, and we appreciate it very much!", "time": "2016-04-22", "author": "OpenTable Diner Since 2010", "restaurant": "Blue Ridge Grill"}, {"review": "went to blue ridge for client dinner. the food was superb, as was service. the noise level was quite loud and I found it difficult to hear others speaking. we were a party of five, in the middle of the floor.", "time": "2016-04-21", "author": "fwNYC", "restaurant": "Blue Ridge Grill"}, {"review": "The food is always exceptional and our waiter was superb!!! A wonderful place to celebrate a birthday of a special friend.  They presented a delicious new Passion fruit raspberry ice cream treat...yummmmmmy!", "time": "2016-04-19", "author": "LiveLoveLaugh", "restaurant": "Blue Ridge Grill"}, {"review": "The service is great. They remembered us from our last visit over a month ago.  I had the short ribs and my husband had the Mediterranean fish. Both entrées were excellent.  I highly recommend this restaurant.", "time": "2016-04-16", "author": "OpenTable Diner Since 2015", "restaurant": "Blue Ridge Grill"}, {"review": "Great food.  Entrees are good to split for two as well.", "time": "2016-04-09", "author": "OpenTable Diner Since 2014", "restaurant": "Blue Ridge Grill"}, {"review": "Service was outstanding.   Special pork loin/risotto interesting.", "time": "2016-04-08", "author": "MrConcert", "restaurant": "Blue Ridge Grill"}, {"review": "We've been several times the food is excellent, nice portions , presentation is very good. Have not had a bad meal , always been  very consistent. Had friends visiting from Florida took them to Blue Ridge which they thoroughly enjoyed.  Lucky to have this place 3 minutes from us.\nKeep up the great work!", "time": "2016-04-08", "author": "Lenny", "restaurant": "Blue Ridge Grill"}, {"review": "I've been to this restaurant many times over the years and I have NEVER been disappointed in any aspect of the experience. The ambience is that of a cozy high end mountain lodge with a lovely sleeping porch for drinks - perfection.  The staff is always attentive, knowledgeable, polite. Always. Food is to die for. They start you out with your very own warm and crusty boule which I have to restrain myself from devouring. I often get the blue ridge salad - pears, blue cheese - yum! And I'm a fish fan. They do fish. REALLY well.  You can't go wrong.  But they also do everything really well so go for whatever your palate demands. And lastly, the warm chocolate molten cake is the poster child for all molten cakes. Do yourself a big favor and get it.  Yes, I love this place. Go for yourself and you will too!", "time": "2016-04-04", "author": "OpenTable Diner Since 2013", "restaurant": "Blue Ridge Grill"}, {"review": "This was my first visit to BRG.  I went with my husband on a Sunday night with a 7:30pm reservation.  The restaurant was mostly full but wasn't very loud which I liked! \nThey brought out fresh sourdough bread to start, hot like it has just come from the oven; it was delicious; we finished the entire loaf.\nI  had the GA Trout for my entree and my husband had the Beef Shortrib; both were excellent, cooked to perfection.  Trout dish was much bigger than expected, I couldn't finish it all but they did it just right where the skin was crispy and the meat was still tender and juicy.\nWe had the corn souffle for a side; excellent choice and it's sweet so it served as our dessert as well.  We will definitely be going back to try some of the other offerings.", "time": "2016-04-03", "author": "Ksamp", "restaurant": "Blue Ridge Grill"}, {"review": "We have been to Blue Ridge Grill multiple times.  It has always been a consistent excellent experience.  Unfortunately they fell a little short this time.  They were quite busy with what looked like a prom crowd which may explain some of the issues.  Neither the food nor the service was up to their usual quality.  Will be back with hopes that this wasn't the new normal.", "time": "2016-04-02", "author": "OpenTable Diner Since 2008", "restaurant": "Blue Ridge Grill"}, {"review": "Food was beautiful and delicious. Service was impeccable.", "time": "2016-04-02", "author": "OpenTable Diner Since 2014", "restaurant": "Blue Ridge Grill"}, {"review": "We have been to Blue Ridge Bar and Grill several times. The prices are fairly high but consistent with that type of upscale steak house. I have enjoyed most food items I have tried and would recommend that you ask the servers about any items not on the menu i.e. friend pickles.  Most recently, I tried their wedge salad and surprisingly, did not care for it- I think it was their avocado dressing that I did not like.\nThe service is always excellent and the salad was removed from our bill- we didn't ask for it but I think it was the right choice because it was hardly touched and I mentioned it right away.", "time": "2016-04-01", "author": "OpenTable Diner Since 2016", "restaurant": "Blue Ridge Grill"}, {"review": "Always an excellent choice for dinner.  Corn soufflé never disappoints", "time": "2016-04-01", "author": "OpenTable Diner Since 2001", "restaurant": "Blue Ridge Grill"}, {"review": "We enjoyed our  family Easter Lunch at Blue Ridge Grill.  There is a great menu and the service and food is wonderful.  The atmosphere is extremely welcoming for a family - very nice but not stuffy.  Highly recommend Blue Ridge - have taken out of town folks there who also enjoyed.", "time": "2016-03-27", "author": "OpenTable Diner Since 2005", "restaurant": "Blue Ridge Grill"}, {"review": "We enjoyed the food, although my eggs were cold. The service was excellent. I wish we had more options on the menu.", "time": "2016-03-27", "author": "OpenTable Diner Since 2016", "restaurant": "Blue Ridge Grill"}, {"review": "We repeat the service was wonderful!! The server was very attentive, we were not rushed, and special request were honored. \nThe food is 100% present over rated! The scallops were very good but overdone, the dish would have been best serve by less sauce and spices. The spices and flavors did not compliment each other.\nI would go back for drinks and maybe an appetizer but not dinner or lunch.", "time": "2016-03-26", "author": "goperu", "restaurant": "Blue Ridge Grill"}, {"review": "This was our first visit to Blue Ridge Grill. We were celebrating my husband's birthday. We arrived about 25 minutes early (to beat the traffic) and we asked to go to the bar until time for our reservation. The bar is great - the warm cheese wafers are killer - the bartender friendly. We had a lovely dinner - I had the trout and my husband had the short ribs. We shared a mac n cheese side. Both were perfect. I was glad someone told me to notify the restaurant that we were celebrating a birthday - my husband's name was on our menu! We had all kinds of treats - candies, special dessert, box of dessert wafers to take home. So special.", "time": "2016-03-25", "author": "Vacplanner", "restaurant": "Blue Ridge Grill"}, {"review": "Thank you for another great meal.  As always, I enjoyed it.", "time": "2016-03-25", "author": "Katie", "restaurant": "Blue Ridge Grill"}, {"review": "Blue Ridge Grill is consistently excellent. I can always count on the food, service and ambience to be perfect for both personal and business guests\nVery good service staff starting at the front desk", "time": "2016-03-22", "author": "OldFortBill", "restaurant": "Blue Ridge Grill"}, {"review": "Great neighborhood restaurant.  My favorite.  My go to for dinner, drinks or meeting friends or with family/special occasions.\nThe food is always excellent and the staff fantastic!", "time": "2016-03-20", "author": "s12345", "restaurant": "Blue Ridge Grill"}, {"review": "The special occasion was my wife's birthday.  She truly enjoyed herself with friends and family.", "time": "2016-03-19", "author": "OpenTable Diner Since 2008", "restaurant": "Blue Ridge Grill"}, {"review": "It is always a pleasure to dine here. The food is excellent and the setting warm and comfortable. It is so nice to relax and enjoy a pleasant lunch or dinner.", "time": "2016-03-13", "author": "OpenTable Diner Since 2007", "restaurant": "Blue Ridge Grill"}, {"review": "A close friend treated me to a great birthday lunch at Blue Ridge Grill: crab cake with frisee and grain mustard sauce, lobster cobb salad, banana cream pie. Service by waiter Ben could not have been better. Reservation through Open Table made the experience much easier. Thanks to all.", "time": "2016-03-11", "author": "Jacmac4000", "restaurant": "Blue Ridge Grill"}, {"review": "Had lunch with a new client at Blue Ridge and was not disappointed and neither was my client. We all had salads and everything was fresh and quite refreshing.  service was efficient but not intrusive.  The lunch menu is a somewhat limited but the offerings are all very attractive. Always a very safe and reliable spot for a good meal.", "time": "2016-03-09", "author": "EWAET", "restaurant": "Blue Ridge Grill"}, {"review": "Recommended this venue to others and always receive positive comments.  I have dined here for business several times and am always satisfied with the food, wine and service.  Seeing every table filled every time I’ve been here is a confirmation of the customer’s satisfaction.  Nothing pretentious here.  One of my favorites.", "time": "2016-03-08", "author": "OTPFan", "restaurant": "Blue Ridge Grill"}, {"review": "One of the best dining experiences I have ever had.   Service was wonderful, greeted by name upon arrival, warm towels between appetizer and entrée, nice chilled mints and thankful departure by the staff after our meal.\nOur party of 6 enjoyed a wonderful time.   Mussels and Raw oyster appetizers were very tasty.\nThe trout was really great, cooked perfectly.  The hot cooked-to-order chocolate cake for desert was unbelievable!", "time": "2016-03-07", "author": "OpenTable Diner Since 2009", "restaurant": "Blue Ridge Grill"}, {"review": "Outstanding in every way - over the top special touches for my mother's birthday, fresh delicious seafood, excellent service.  You have a customer for life!", "time": "2016-03-06", "author": "OpenTable Diner Since 2008", "restaurant": "Blue Ridge Grill"}, {"review": "The grilled trout is amazing. Great ambiance, wine list and service. Valet parking is always a plus. Everyone was happy and we also split the corn pudding. Better than dessert.", "time": "2016-03-06", "author": "OpenTable Diner Since 2008", "restaurant": "Blue Ridge Grill"}, {"review": "We had a wonderful dinner to celebrate a very special event.  The drinks were perfectly prepared.  We also ordered a bottle of Three Willamette Valley Oregon Pinot Noir 2013.  We had fresh oysters and pan seared goat cheese appetizers.  We each had different entrees: salmon, duck pot pie, scallops and the trout.  We also enjoyed corn souffle and sauteed spinach appetizers.  To conclude, we had a chocolate cake dessert.   With the tip (and the service was excellent), the bill came to $400 for the four of us, which we felt was a fair price for the food, beverage, ambiance and our celebration!", "time": "2016-03-05", "author": "OpenTable Diner Since 2012", "restaurant": "Blue Ridge Grill"}, {"review": "We have spent every March 1st with Blue Ridge over the past five years, and we will continue as long as Blue Ridge continues to maintain such high standards for service, selection, and overall great time!  Whatever you do, for a side you must have the corn souffle - it is fantastic.  I had the pork this time and my wife had the trout, both were great.  For dessert we have the chocolate molten lava cake, it melts in your mouth.", "time": "2016-03-02", "author": "BirthdayRuined", "restaurant": "Blue Ridge Grill"}, {"review": "From the lovely greeting at the front door to the expertly provided table service, we experienced the best Atlanta had to offer in celebration of our daughters 21st birthday.  The custom prepared menu and table decorations enhanced the surprise and delight.  Superb experience and memories for our special occasion.  Highly recommend this neighborhood gem!", "time": "2016-02-28", "author": "ExperienceLocalFoodOnly", "restaurant": "Blue Ridge Grill"}, {"review": "Local upscale Buckhead restaurant with lists of regulars because it is always good!", "time": "2016-02-28", "author": "OpenTable Diner Since 2001", "restaurant": "Blue Ridge Grill"}, {"review": "I brought my husband here for his birthday, and everything was superb!  From the moment we got there and were led to a table with festive birthday decorations to the care our waiter took of us, it was a memorable dinner.  We started with the lobster bisque, which was very flavorful.  My husband loved his thick lamb chops for his entree, and I enjoyed the salmon with mushroom ravioli.  For dessert, our waiter brought us the molten lava cake with a lighted candle on the side of the plate.  We were stuffed, but happy with the way the restaurant treated us.", "time": "2016-02-27", "author": "OpenTable Diner Since 2005", "restaurant": "Blue Ridge Grill"}, {"review": "Food was ok. There were 4 of us 2 were pleased. We had the trout 2 of us not so good. Service was too rushed...4 friends wanted some special time and after cocktails/wine/appetizers/main course/coffee and dessert less than 2 hours 1.48 to be exact. Lot of money for not much.", "time": "2016-02-25", "author": "OpenTable Diner Since 2006", "restaurant": "Blue Ridge Grill"}, {"review": "Great service.  Great menu.  Anything that you would want.  Food excellent.  Great bar area and view.", "time": "2016-02-23", "author": "Paisley", "restaurant": "Blue Ridge Grill"}, {"review": "I had not been to the Blue Ridge Grill, prior to this visit, in 10+ years and I don't know why.  Everything was absolutely Incredible!! The hostess called me early in the day to recommend a private room in the wine cellar for our party of 8. It was perfect for a business dinner, quiet enough for conversation, yet lively.  The service was top notch, better than I have had in any restaurant lately.  The food was superb!!!  Everyone in our  ordered something different and all remarked on how good it was, down to the last bite.  Our server, who is from the Bahamas, ( I believe his name is Billington), was spot on.  All 8 meals delivered to the table in unison.  FABULOUS!!", "time": "2016-02-23", "author": "kate", "restaurant": "Blue Ridge Grill"}, {"review": "This was our first time. WE loved it. Atmosphere was terrific Great food.", "time": "2016-02-23", "author": "Billw", "restaurant": "Blue Ridge Grill"}, {"review": "The food and service were excellent and the staff made our birthday celebration much more than we expected. The menu with the birthday name, the confetti, the birthday dessert, and the small gift were all greatly appreciated. What a fun place for any celebration!", "time": "2016-02-22", "author": "HowellMillNeighbor", "restaurant": "Blue Ridge Grill"}, {"review": "Good food good service.  Quiet table setting. I come almost every time in in Atlanta.", "time": "2016-02-22", "author": "Allen", "restaurant": "Blue Ridge Grill"}, {"review": "Our family went for our son's BD. Extremely memorable meal. Five stars all around. Would recommend to everyone. Excellent.", "time": "2016-02-21", "author": "OpenTable Diner Since 2006", "restaurant": "Blue Ridge Grill"}, {"review": "Outstanding!!  We had a private room for 8 guests,  great service and wonderful food.  Everyone enjoyed and raved about their dinner.  I highly recommend Blue Ridge for special occasions and great food!!", "time": "2016-02-21", "author": "OpenTable Diner Since 2011", "restaurant": "Blue Ridge Grill"}, {"review": "I like the environment I wish the food met that....", "time": "2016-02-21", "author": "CherieA", "restaurant": "Blue Ridge Grill"}, {"review": "We decided to try Blue Ridge Grill and glad we did. Food was great and the service was even better. We will be going back soon. Ask for Dimitri.....he is a very good server.", "time": "2016-02-20", "author": "Leroy", "restaurant": "Blue Ridge Grill"}, {"review": "Attention to detail included table with confetti, Hershey kisses, menu with birthday persons name, complementary dessert and gift! \nService and food was impeccable. We will return!", "time": "2016-02-20", "author": "OpenTable Diner Since 2010", "restaurant": "Blue Ridge Grill"}, {"review": "Meal was awesome, staff was very attentive, wine was delicious and special treatment for my birthday. We had a marvelous time.", "time": "2016-02-20", "author": "OpenTable Diner Since 2012", "restaurant": "Blue Ridge Grill"}, {"review": "We love Opentable and the map navigator.  Using it made us remember that if we just hold on.....we would pass the congestion of Downtown ATL and return to our favorite BRG which essentially, is right off the interstate with easy off and easy park with the best Valet.   The hearty welcome from Patrick and his assistant was pleasant and sincere.  The service provided all evening was compliments of Demitar (Dimitri) who showed us the full depth of his knowledge and charisma.  The salmon appetizer was \"Gone in 60 seconds!\"  Yum, three more of those please!  We had a lovely impulsive evening and I wouldn't choose another restaurant to enjoy choice wine, a well thought out menu and personalized service.  We will always recommend BRG to you and our family!  Chow!", "time": "2016-02-19", "author": "ExperienceLocalFoodOnly", "restaurant": "Blue Ridge Grill"}, {"review": "Great Restaurant.  Excellent food.  We WILL be back.  Noise level was moderate to low and very easy to hold a conversation around a table of 6.", "time": "2016-02-16", "author": "LeroyC", "restaurant": "Blue Ridge Grill"}, {"review": "I took my boo to this place because we've always wanted to try it.  It reminded us of a cabin in Blue Ridge for sure and earns it's name. The service was incredible and our waitress was knowledgeable about the menu. The only thing that was worthy of a complaint was the WAY over priced crab cakes and nothing was really mind blowing.  Overall, it's a great place for a date night.", "time": "2016-02-14", "author": "OpenTable Diner Since 2014", "restaurant": "Blue Ridge Grill"}, {"review": "Waiters were very professional and personable. Food was great. The oysters were verrrry tiny. Crab cake was amazing. Trout was fantastic. Waiters recommendations for non-alcoholic mixed drinks were great as well!", "time": "2016-02-14", "author": "OpenTable Diner Since 2015", "restaurant": "Blue Ridge Grill"}, {"review": "Crab cake starter was delicious. As was the filet and scallops. Have to add the corn soufflé. Service is impeccable. Wouldn't hesitate to go back or send friends.", "time": "2016-02-14", "author": "OpenTable Diner Since 2011", "restaurant": "Blue Ridge Grill"}, {"review": "Booked last minute on V-day week not knowing what to expect.  A bit pricey, but everything from apps to the main course was delicious.  Will definitely be making a trip back with the misses. Thanks for a great night.   Lamar", "time": "2016-02-14", "author": "OpenTable Diner Since 2016", "restaurant": "Blue Ridge Grill"}, {"review": "It was the perfect place for a valentines date. It's the perfect place for any couples date night dining. Their steak is absolutely amazing. We found out they use hickory wood chips which made our meals that more succulent. Wines were very good (reds) that we chose to accompany with. The ambiance was perfect. Busy but expected for a holiday weekend. The service was top notch.  Reservations are highly recommended. As this is a popular place. Attire is casual. Jeans acceptable but no rips or tears. You want to look good when you go here.", "time": "2016-02-14", "author": "Caroline", "restaurant": "Blue Ridge Grill"}, {"review": "I walked in an expected to see Teddy Roosevelt bellied up to the bar, it has a very neat American Lodge type feel with a modern touch. The service was excellent , very top notch.  During none holiday periods I would love to sit at the bar and consume the ambiance , eat some raw oysters and enjoy one of their fine selections of wine.  The raw oysters were the highlight of our meal. The other items we ordered were average for the price point. I would probably go again on a non-holiday night and order something different.", "time": "2016-02-14", "author": "OpenTable Diner Since 2009", "restaurant": "Blue Ridge Grill"}, {"review": "Service was amazing. The food was not what I remembered. I was disappointed, but it is such a nice place with great staff.", "time": "2016-02-13", "author": "OpenTable Diner Since 2005", "restaurant": "Blue Ridge Grill"}, {"review": "Very enjoyable experience. Our meal started with delicious bread and our waitress was knowledgeable and helpful. My husband got the pork chop which he enjoyed. I got the duck pot pie which was delicious. Someone had reported that there was not much duck in theirs but mine was quite full of duck. We started with the Blue ridge salad which was good but we finished with the molten chocolate cake which was over the top yummy!", "time": "2016-02-13", "author": "DrASB", "restaurant": "Blue Ridge Grill"}, {"review": "This is a large busy restaurant with unique mountain lodge construction and décor. It is noisy and at times hard to have a conversation. Large menu with variety. Quality of food is Good to Very Good. Crab cake is good ($17 for 3 ounces). Trout was good but not the flavor you would expect. Short ribs has very good flavor but not as tender as you would expect.  Sauteed spinach was bland but tender. Chocolate molten cake and ice cream was small and not cooked long enough.", "time": "2016-02-13", "author": "jimj", "restaurant": "Blue Ridge Grill"}, {"review": "Always excellent!", "time": "2016-02-13", "author": "OpenTable Diner Since 2000", "restaurant": "Blue Ridge Grill"}, {"review": "Always excellent. Food is good and good wine selection!", "time": "2016-02-12", "author": "Bunny", "restaurant": "Blue Ridge Grill"}, {"review": "My friend and I had a very nice evening. The wine was wonderful and complemented the cuisine beautifully. The ambience was wonderful and the noise level was variable. We said at the round near the fire and we really enjoyed ourselves.  I would recommend this restaurant to anyone looking for a exquisite dining experience.", "time": "2016-02-12", "author": "MsNichols", "restaurant": "Blue Ridge Grill"}, {"review": "Awesome Experience. One of the Best Kept Dining Secrets in Hot Lanta. 21 years Young and going Strong. I have dined at every \"known great restaurant\" in Atlanta for many years and Blue Ridge Grill is at the Top of my list 😊\nGeorge Sims", "time": "2016-02-12", "author": "Prophet", "restaurant": "Blue Ridge Grill"}, {"review": "Had a group of 5 ladies. Everything was wonderful. Our birthday friend felt special with the table decor and the yummy dessert.", "time": "2016-02-09", "author": "Runninglady14", "restaurant": "Blue Ridge Grill"}, {"review": "The main course was bland and not worth the amount of money spent. The collards were good. The service was great.", "time": "2016-02-08", "author": "OpenTable Diner Since 2012", "restaurant": "Blue Ridge Grill"}, {"review": "Our server was incredible and paid attention to detail noticing when our beverages were low they were replenished. Cleaning the table before our main entree arrived. Great service and food and will definitely be coming back", "time": "2016-02-07", "author": "OpenTable Diner Since 2013", "restaurant": "Blue Ridge Grill"}, {"review": "Overall a  good dinner.   Wife had shrimp and lobster risotto, which she loved.    My fish special was only average, and $45 without a side was too pricey.", "time": "2016-02-07", "author": "OpenTable Diner Since 2011", "restaurant": "Blue Ridge Grill"}, {"review": "We had our monthly dinner club at Blue Ridge Grill. The restaurant compares favorably with higher-end locales, but has more of a familiar feel. The ambience is comfortable and inviting as opposed to outwardly and aggressively trendy as a lot of foodie places try to be. \nIt's the sister restaurant of Bones, so expect great red meat if that's your bag. The seafood is excellent, as was the service. It's a nice place to make your fallback, guaranteed good dinner if you are entertaining guests.", "time": "2016-02-06", "author": "KMMc", "restaurant": "Blue Ridge Grill"}, {"review": "Had a great birthday!!  Food was excellent!  Matt was our server, he was great!  Will go back and I highly recommend it.", "time": "2016-02-06", "author": "OpenTable Diner Since 2015", "restaurant": "Blue Ridge Grill"}, {"review": "This popular restaurant exceeded our expectations.  The service was exceptional.  Everyone from the hostess to the bartenders were customer service oriented.  We had a romantic table near the fireplace.\nWhen we asked our server about the painting above the fireplace, he gave us a brief history of the restaurant which we found fascinating.  \nThe crabcakes were as good as other reviewers have noted.  I ordered the filet mignon. My spouse ordered the fish special. We also had the asparagus and whipped potatoes as our sides. For dessert I had the pineapple upside down cake and my spouse had the pecan pie.  Overall it was a wonderful meal.", "time": "2016-02-06", "author": "OpenTable Diner Since 2015", "restaurant": "Blue Ridge Grill"}, {"review": "Very Good effort in every regard for food quality, presentation, service.", "time": "2016-02-06", "author": "MandR", "restaurant": "Blue Ridge Grill"}, {"review": "Service great.  Salad great.  Duck pot pie very disappointing.  Puff pastry topping tough and hard to eat gracefully.  There were all of two pieces of duck in the pie.  Noise level excessive.", "time": "2016-02-05", "author": "OpenTable Diner Since 2016", "restaurant": "Blue Ridge Grill"}, {"review": "Great food, good service.  Cozy and comfortable but also has a bustling energy and elegant decor.", "time": "2016-02-04", "author": "chart", "restaurant": "Blue Ridge Grill"}, {"review": "I travel to Atlanta regularly for business and have found the Blue Ridge Grill to be one of my favorite places to relax, and enjoy a great meal.   I especially enjoy starting off the evening with drinks on their porch.     Have never had a meal that was not excellent, and staff is attentive without being obtrusive.    The rustic décor, well trained staff and the food combine to make a great evening after a long day.", "time": "2016-02-04", "author": "OpenTable Diner Since 2011", "restaurant": "Blue Ridge Grill"}, {"review": "We had a large party and the  staff was very attentive to all of us.  We will definitely refer Blue Ridge Grill to coworkers and friends.", "time": "2016-02-03", "author": "Cher", "restaurant": "Blue Ridge Grill"}, {"review": "Blue Ridge Grill is a fantastic restaurant, with great ambiance, great food and exceptional service. As much as I liked this place when I first came here 25 years ago, I like it even better now. Can't go wrong, be it special occasion or just a nice dinner out.", "time": "2016-01-31", "author": "OpenTable Diner Since 2012", "restaurant": "Blue Ridge Grill"}, {"review": "Incredible ambiance.  The staff always does an incredible job talking about the food, helping select wines and generally ensuring a great evening.  I'm very particular about food and Blue Ridge never ceases to amaze.  The pairings are incredible and the presentation is outstanding.", "time": "2016-01-30", "author": "Loves2Eat", "restaurant": "Blue Ridge Grill"}, {"review": "Upscale restaurant but very kid friendly the staff was great food was great as well as the atmosphere!", "time": "2016-01-30", "author": "Bev19footb", "restaurant": "Blue Ridge Grill"}, {"review": "Great place for ANY occasion!  We have been there to celebration anniversaries, birthdays, business lunch or business dinner.  We have enjoyed the use of their private rooms - which includes great service and attention.  They will not disappointment in either service or menu.", "time": "2016-01-29", "author": "Charmed", "restaurant": "Blue Ridge Grill"}, {"review": "The steaks filet and ribeye were poor cuts and not good.   Very poor value for the quaility.  Had not been for a few years and will not be returning by choice", "time": "2016-01-28", "author": "Wonderful", "restaurant": "Blue Ridge Grill"}, {"review": "Celebrated a birthday while in the Atlanta area and found this restaurant on Open Table. Great food and wonderful staff. Everyone was friendly and extremely helpful. Molten Lava cake is to die for.", "time": "2016-01-27", "author": "Cynlangley", "restaurant": "Blue Ridge Grill"}, {"review": "Another first class lunch at the Blue Ridge Grill.  Loved the Lentil Soup and Arugula and Roasted Squash Salad.  Service was exceptional.  Delightful experience in every way.", "time": "2016-01-27", "author": "MacAtlanta", "restaurant": "Blue Ridge Grill"}, {"review": "As always, the service was excellent.  My one complaint was that the entree chef salad was too small with a modest amount of chicken.  You find a better salad for the same price at Houston's and Canoe.", "time": "2016-01-27", "author": "Hd1234", "restaurant": "Blue Ridge Grill"}, {"review": "Blue Ridge Grill is my stand by for business  lunch.  The service is always spot on and the food intriguing and portioned well.  They always deliver!!", "time": "2016-01-26", "author": "OpenTable Diner Since 2011", "restaurant": "Blue Ridge Grill"}, {"review": "From the moment I arrived, the valet was kind and pleasant!\nThe hostess was a perfection of grand hospitality\nThe server Ambry was exceptional in service\nThe chef prepared hallmark culinary dishes which very few chef's can achieve!\nPricing was more then favorable\nThe General Manager ask me how was my lunch...another example of people who are there to please you!\nI will return....and return again!", "time": "2016-01-25", "author": "Joi9", "restaurant": "Blue Ridge Grill"}, {"review": "Needed a nice spot for an early dinner in Buckhead, and had not been to BRG for a while.  It really is a classy joint.  \nFew Atlanta rooms are as comforting and inviting as the lodge atmosphere here, and the service (absent one significant error) was wonderful.   The staff was gracious and understanding of our 4.5 yo dining companion, and we really had a good meal.\nWe will definitely keep Blue Ridge Grill in our rotation.", "time": "2016-01-23", "author": "Josh", "restaurant": "Blue Ridge Grill"}, {"review": "Matt was an awesome waiter! Try the mashed potatoes...delish!", "time": "2016-01-21", "author": "OpenTable Diner Since 2010", "restaurant": "Blue Ridge Grill"}, {"review": "We love coming back here.  The North Georgia trout NEVER disappoints -- it is one of the high points, but they do all seafood well.  We love the skirt steak when they have it, or any meat is well prepared.  The vegetables are great, but the arugula salad is always one of our favorites.  Have not tried many of their desserts, but usually because we have overeaten.  Private dining rooms below are great, or lunches for great business meetings. \nAlthough not on the menu, the Blue Ridge Grill has the best fried pickles in Atlanta.", "time": "2016-01-20", "author": "Dukeparent", "restaurant": "Blue Ridge Grill"}, {"review": "Great bar and menu.  Unique selections on the menu and the service was excellent.  Use primarily for entertaining clients when I come to Atlanta.", "time": "2016-01-19", "author": "Mike", "restaurant": "Blue Ridge Grill"}, {"review": "After driving by for many years, I finally took my parents to try it out and couldn't have been more impressed. The service was excellent as was the food. They had a gluten free menu, great for my mom who has celiac disease. The fresh bread was straight for the oven and great for dunking in the fantastic mussels appetizer. I order mussels almost always when available, and the Blue Ridge Grill serves some of the best. Very fresh, great garlicky and creamy flavor in the broth. All 4 of us enjoyed our entrees - scallops, duck pot pie, black cod, and pork. They were well seasoned and a delight to the palate. I can't wait to go back!", "time": "2016-01-19", "author": "natkin", "restaurant": "Blue Ridge Grill"}, {"review": "Fist time going to the restaurant and was taking NYC business associates, we all could not have been more impressed with the food, decor, atmosphere and service. Highly recommend!", "time": "2016-01-18", "author": "OpenTable Diner Since 2012", "restaurant": "Blue Ridge Grill"}, {"review": "Blue Ridge is one of our favorite restaurants in Atlanta.  \nIt is consistently good, comfy, delicious with great service.  \nThe hot baked bread is a piece of Heaven, and they don't charge extra for it!", "time": "2016-01-18", "author": "Nemos", "restaurant": "Blue Ridge Grill"}, {"review": "Really enjoyed the Blue Ridge Grill once again! Food was great, although my wife shared later that her lobster gnocchi could have been served hotter, otherwise great evening!", "time": "2016-01-17", "author": "OpenTable Diner Since 2010", "restaurant": "Blue Ridge Grill"}, {"review": "Me and my wife had a birthday dinner here. Our service was impeccable. We were greeted, seated, and served with speed and friendliness. Our food was just OK. The scallops were flavored well but a little over cooked and chewy. My filet was more medium than medium rare. For a Steak and Seafood restaurant I would expect scallops and filet to be on point.", "time": "2016-01-16", "author": "YourNormalDiner", "restaurant": "Blue Ridge Grill"}, {"review": "From the time we walked in and out the door  was a truly great experience. Every staff member we came across was very pleasant and the service  was outstanding.  The menu options vary with many choices that might make it hard to make a decision for a foodie (like me) but you won't be disappointed with anything you pick,just plan to come back to try more!", "time": "2016-01-15", "author": "CherryC", "restaurant": "Blue Ridge Grill"}, {"review": "The food was fantastic, loved the lobster bisque. A little on the expensive side, so more of a special occasion type place, but well worth it.", "time": "2016-01-15", "author": "TakeAChance", "restaurant": "Blue Ridge Grill"}, {"review": "Very high priced for lunch, however the food and service were outstanding. Seemed to be mostly business lunches.", "time": "2016-01-15", "author": "Popa", "restaurant": "Blue Ridge Grill"}, {"review": "We recently dined at The Blue Ridge Grill for our anniversary.  The restaurant has special menus that say \"Happy Anniversary\" on top (same food as normal menu) and they decorated the table with sequins and glitter before we were seated.   The service was attentive without being overbearing.  The food was well prepared and tasty.  The ambiance of the restaurant is warm and inviting.  I especially liked the large portrait of a well dressed rabbit over the fireplace!  Our visit was on a weeknight and there seemed to be a good bit of traffic from local executives, lots of business talk going on.  The only thing I did not like was a fairly high noise level.  Other than perhaps making some acoustic modifications to the building, I don't think there is much the restaurant could do about that.  I would definitely go back!", "time": "2016-01-13", "author": "klcga", "restaurant": "Blue Ridge Grill"}, {"review": "Two iced teas, two lunch salads (one with no meat), two soups and one dessert cost $85.82 with tip - at lunch.   The food was blah, so not worth the price at all.   Next time, I'll go to Ray's on the River.", "time": "2016-01-13", "author": "Diana", "restaurant": "Blue Ridge Grill"}, {"review": "Never a favorite, I return here because of its location and consistency. The food is good, if uninspired. Service very good. Prices are a bit steep, but location likely demands it. Getting in and out during rush hour can be difficult.", "time": "2016-01-11", "author": "GeorgiaGuy", "restaurant": "Blue Ridge Grill"}, {"review": "Excellent food and the service was very good. James K was our waiter and he did an excellent job. I'll definitely plan a return trip", "time": "2016-01-10", "author": "OpenTable Diner Since 2009", "restaurant": "Blue Ridge Grill"}, {"review": "Blue Ridge Grill is one of our favorite restaurants.  The menu is comprehensive and an added bonus are the nightly specials that are typically offered.  They also offer a nice selection of side dishes served family style.  All food is well-prepared.  The pace of the meal is fine and the servers do not rush you.  This was especially appreciated on Saturday night when we were having a catch-up dinner with friends that we had not seen in two years.  All of the staff, including the valet parking are pros at what they do.", "time": "2016-01-09", "author": "JGBKRB", "restaurant": "Blue Ridge Grill"}, {"review": "The service, food, and level of professionalism was excellent!", "time": "2016-01-09", "author": "OpenTable Diner Since 2008", "restaurant": "Blue Ridge Grill"}, {"review": "This gem of a restaurant offers terrific food and the service is outstanding.  We went with another couple and had a terrific time.  The menu was diverse and creative.  My husband had the duck pot pie and loved it.  I had short ribs and they were done perfectly.   The parking is a bit odd, I would avoid the valet and opt to park very close in a large lot right next door.", "time": "2016-01-09", "author": "12many", "restaurant": "Blue Ridge Grill"}, {"review": "I think that the food and the service was just average.  I do want to go back and see if things improve.  maybe on a weekday when it is not so crowded", "time": "2016-01-08", "author": "Yummy", "restaurant": "Blue Ridge Grill"}, {"review": "I took my wife to Blue Ridge Grill to celebrate her birthday. The hostess and the wait staff was very attentive and the food was excellent. It really made for a wonderful evening.", "time": "2016-01-07", "author": "JB53", "restaurant": "Blue Ridge Grill"}, {"review": "Superb food, great atmosphere, fantastic service! Wonderful place to celebrate a birthday or special occasion.", "time": "2016-01-07", "author": "OpenTable Diner Since 2013", "restaurant": "Blue Ridge Grill"}, {"review": "I love, love Blue Ridge Grill...\nNever disappointed with the food nor the service.   My family has been for Birthdays, Holidays  and just because.  Great brunch menu and overall just consistent every time.   Would go back time and time again.", "time": "2016-01-03", "author": "OpenTable Diner Since 2012", "restaurant": "Blue Ridge Grill"}, {"review": "Blue Ridge is a family favorite for special occasions. We had the 8 oz tenderloin steaks that melt in your mouth! I was a bit disappointed that the wedge salad did not have the traditional blue cheese dressing, we did not care for the avocado dressings, and our lobster bisque was not hot, thus the reason for not giving a 5 star on the food.", "time": "2016-01-03", "author": "mammis", "restaurant": "Blue Ridge Grill"}, {"review": "The four of us enjoyed Blue Ridge, very good service, but food was just OK, especially considering the price. Very nice ambience and could be nice restaurant for a special event. We may have chosen different food and enjoyed it more.", "time": "2016-01-02", "author": "Andrew", "restaurant": "Blue Ridge Grill"}, {"review": "Blue Ridge Grill is wonderfully romantic place, with some of the best food in Atlanta.\nWe've eaten at many of the purported best steakhouses in ATL, but nothing beats the 8oz Filet, with sides of corn souffle and mac and cheese at Blue Ridge Grill! The steak cuts like butter; exceptionally high quality. The souffle is so soft and sweet, and I love the crunchy top layer of the fabulous mac and cheese. Just a great meal! We started by sharing a wedge salad, which was crisp and nice. A nice bottle of Silver Oak Cab made this an outstanding New Year's Eve meal. No room for dessert.  :-)\nBRG is always a wonderful evening. We always arrive about 45 minutes before our reservation and have a glass of wine and a romantic start to the evening sitting out on the enclosed porch off the bar. Gita is a warm and wonderful server and the freshly baked cheese crackers are a great beginning. The main dining area has such a nice feel to it. Even though the place is always bustling and full, it is very easy to maintain a romantic table conversation in the half-circle booths where we always sit. (Tip: For a romantic dinner, tell the front desk when you check in that you are willing to wait for one of these booths, and then pass the time on the patio. The experience is well worth the wait.)\nWe've always gotten great service at BRG, but our favorite server is Rog (pronounced: raj). She is warm, knowledgeable and a professional server. If you have never experienced a \"professional server,\" ask for Rog and prepare for a treat. We travel all over the world and can honestly say that Rog is top-tier. BRG experimented for a while with having service by \"teams,\" but they have (thankfully!) dropped the practice so you can enjoy great service by one server who has time to focus on your needs. \nBlue Ridge Grill is simply one of the very best places in Atlanta for a special night out.", "time": "2016-01-01", "author": "Paul", "restaurant": "Blue Ridge Grill"}, {"review": "Every aspect of this restaurant was excellent. For a New Years Eve dinner this was far more than we expected!!", "time": "2015-12-31", "author": "BDHC", "restaurant": "Blue Ridge Grill"}, {"review": "I have one word for both the service and food, EXCELLENT.  Our waitress was awesome.  She was genuinely concerned that we were pleased at every turn.", "time": "2015-12-31", "author": "WilTal", "restaurant": "Blue Ridge Grill"}, {"review": "This was our first trip to Blue Ridge Grill and went with friends who also enjoy great food.  The atmosphere was excellent - nice, rustic cabin/lodge feel.  Our server was outstanding both with engaging us in conversation and answering questions we had on the menu.   Food was exceptional - salad, main entree and desserts.  It was a great evening.  Didn't leave feeling stuffed, just satisfied.  All the food was so fresh and flavorful.  I would recommend Blue Ridge Grill and plan to return!  It's a little pricey, but you won't be disappointed with the experience or the food.", "time": "2015-12-30", "author": "OpenTable Diner Since 2010", "restaurant": "Blue Ridge Grill"}, {"review": "We celebrated our anniversary and the Blue Ridge Grill made everything festive. The table was set with confetti and little hearts, the menu had an anniversary wish, our meals were perfect and we were treated to lovely desserts. Our server was also attentive and excellent.  I can't say enough about how wonderful our experience was.", "time": "2015-12-28", "author": "yummy", "restaurant": "Blue Ridge Grill"}, {"review": "Blue Ridge Grill just celebrated its 20th birthday and they have not missed a beat. They have been true to their original formula since the beginning. Lunch or dinner, the food is always well-executed and the service impeccable. They are among the best in Atlanta.", "time": "2015-12-28", "author": "Marc", "restaurant": "Blue Ridge Grill"}, {"review": "Blue Ridge Grill has for years been one of our favorites. We have gone there for anniversaries and this last time for my wife's birthday. Never had a bad experience....always great.", "time": "2015-12-27", "author": "OpenTable Diner Since 2014", "restaurant": "Blue Ridge Grill"}, {"review": "We had a delightful evening with friends.  The service was EXCELLENT, and everyone was pleased with their meal.  One person even asked to change the Blue Ridge Salad (house specialty)from field greens to Romaine and Spinach.  She was very happy with her creation!", "time": "2015-12-27", "author": "Effood", "restaurant": "Blue Ridge Grill"}, {"review": "The first thing I noticed was how friendly everyone was from the Valet, Hostess and Servers.  The server we had made sure we understood the menu options and made great suggestions.  The food arrived and all 5 of us were extremely impressed with the taste and amount of food we got.  The whole dining experience was top quality.  The night was a special night and Blue Ridge Grill complimented the occasion.", "time": "2015-12-27", "author": "Steve", "restaurant": "Blue Ridge Grill"}, {"review": "We tried this restaurant based on great reviews and an appealing menu. We were not disappointed.  Food, service and ambiance were wonderful. Our server was Evan and he did a great job; well versed on the menu.  I would highly recommend this place to others.", "time": "2015-12-26", "author": "Terry", "restaurant": "Blue Ridge Grill"}, {"review": "I always have a good meal at the Blue Ridge Grill. The portions aren't particularly large; I think it's a bit pricey but the food is always excellent & the service is very good. I just never think to go there...I'm never disappointed!", "time": "2015-12-23", "author": "Carotopp", "restaurant": "Blue Ridge Grill"}, {"review": "We expect a great meal here every time we come and BRG delivers. The ambiance, service, food quality and presentation are excellent. Try the pan seared scallops, wedge salad or lobster bisque - all signature items. Fairly extensive wine list too.", "time": "2015-12-19", "author": "Aguyfromatlanta", "restaurant": "Blue Ridge Grill"}, {"review": "The steak was excellent one of the best flavored steak ever.  Our server was wonderful!  A great place for an Anniversary, special occasion or business.", "time": "2015-12-18", "author": "BradE", "restaurant": "Blue Ridge Grill"}, {"review": "Always good food,good service and a friendly staff. Valet parking and the option for private parties downstairs is a big plus.", "time": "2015-12-16", "author": "Sharon", "restaurant": "Blue Ridge Grill"}, {"review": "Came to Blue Ridge Grill to have a holiday celebration with friends.  The service was great, the ambiance good, but the food left me disappointed.  I ordered the Shrimp and Grits and the grits were undercooked, the shrimp \"chewy\" and there was very little seasoning.  I was really disappointed since I was the one that recommended the restaurant.  We will definitely pick a different location for our next get together.", "time": "2015-12-14", "author": "OpenTable Diner Since 2007", "restaurant": "Blue Ridge Grill"}, {"review": "Don't get me wrong, everything was good... The issue I had with my meal was that, for the price, there is MUCH better in Atlanta. I certainly would not dissuade any one from eating here, but if my friends, family, or co-workers were looking for a great steak house/ upscale dining experience, there are at least 8-10 places in Atlanta I would suggest first. High notes for the corn soufflé... it was a surprise treat. Low notes for the shocking slowness of our server and the kitchen.", "time": "2015-12-13", "author": "OpenTable Diner Since 2010", "restaurant": "Blue Ridge Grill"}, {"review": "The service here is particularly outstanding.  When you make special requests they read them and honor them.  They do their best to make special occasions special.  And the food and wine are always great.", "time": "2015-12-12", "author": "Appreciative", "restaurant": "Blue Ridge Grill"}, {"review": "Blue Ridge made our dinner celebrating our Wedding Anniversary special.  Great food, Great service, Easy parking.\nWe were seated in a timely manner.  You will not regret finding this gem.", "time": "2015-12-10", "author": "OpenTable Diner Since 2012", "restaurant": "Blue Ridge Grill"}, {"review": "I got the braised rib.  It was fork tender and very tasty.", "time": "2015-12-09", "author": "OpenTable Diner Since 2013", "restaurant": "Blue Ridge Grill"}, {"review": "The food was wonderful, and the service was outstanding.  Never hovering but always sure everything was ok.  It was a romantic spot for our 18th anniversary.", "time": "2015-12-07", "author": "OpenTable Diner Since 2006", "restaurant": "Blue Ridge Grill"}, {"review": "Birthday dinner for the husband. Very nice arrival, drinks on porch (best martini), table festive with candies and confetti, birthday menus. But then just lackluster service, my flounder over cooked and dry, lava cake all gooey lava. Really wasn't sure it was cooked enough. For the price and reputation, expected more. Will try 1 more time and hope this was just an aberrancy.", "time": "2015-12-06", "author": "Goldigwife", "restaurant": "Blue Ridge Grill"}, {"review": "The service was very poor.  We were seated at approximately 12:30P and didn't receive our food until 2P or so.  We watched at least 4 to 5 groups of people come in after us, seated in the same area and received their food before us.  Once we brought this matter to the manager's attention he was very nice and accommodating.  My first thought was to never go back; however, the manager's personality and attentiveness convinced me to give the restaurant another chance.  Everything else was exceptional and the food was excellent!!!", "time": "2015-12-06", "author": "Tigereyes", "restaurant": "Blue Ridge Grill"}, {"review": "Blue Ridge Grill is on our short list of great Atlanta Restaurants.  If you are looking for terrific food and service, the Blue Ridge Grill merits an initial and many repetitive visits.", "time": "2015-12-06", "author": "JGBKRB", "restaurant": "Blue Ridge Grill"}, {"review": "We have been here on a few occasions and have had wonderful experiences.  However, this time was not as good as in the past.  Maybe is was my state of mind, but I just did not want to pay $42.00 for a steak, so I opted for the stuffed chicken breast.  My wife and I also shared the scalloped corn as it had great reviews from past diners.  Well, the chicken was tasty, but a bit over-cooked.  In addition, it seemed to be the size of a Cornish game hen breast.  This was quite a disappointment as it came in at $25.00.  The scalloped corn was very sweet as if the chef over did it with the sugar.  I have been in the south for a long time, so sweet sides are to be expected, but not this sweet.   My wife is southern and found it too sweet as well.  I think that it will be awhile before we come back as there are too many good restaurants to eat at in Atlanta.  We were disappointed.", "time": "2015-12-03", "author": "FranA", "restaurant": "Blue Ridge Grill"}, {"review": "Outstanding service for a birthday dinner. The attention to detail and customer service is incredible! I've recommended several people to celebrate their special occasion at Blue Ride Grill.", "time": "2015-12-02", "author": "Nina", "restaurant": "Blue Ridge Grill"}, {"review": "From the charming British manager to our well trained server, if was a relaxing and sumptuous meal. Servers undergo 3 weeks of training before serving customers and it really shows. The salmon was cooked to perfection as was the corn souffle. On the dessert side the chocolate volcano cake is deadly and I mean that in a good way. Although it's in a posh neighborhood at the end of West Paces, the menu is sensibly priced.\nIts a big place and we saw several groups of 6-8 people, so it might be perfect for a family gathering/celebration. We were just a couple and found it perfect for our anniversary celebration.", "time": "2015-11-23", "author": "GregH", "restaurant": "Blue Ridge Grill"}, {"review": "Food and service were great.  Wonderful brunch selection, can't go wrong with anything on the menu.", "time": "2015-11-22", "author": "OpenTable Diner Since 2012", "restaurant": "Blue Ridge Grill"}, {"review": "Brought my wife to celebrate her Birthday. I had ordered flowers and they were on the table with menus that said Happy Birthday. We had the filet and it was one of the best we had ever had. Our waitress was excellent with the service. We will be going back to visit again.", "time": "2015-11-21", "author": "Smokediver354", "restaurant": "Blue Ridge Grill"}, {"review": "Although we go to Blue Ridge Grill for other occasions, this is our third year of celebrating our anniversary here.  It's the attention to detail that makes the experience great.  And that's over and above the great menu selections which are amazingly tasty as they are beautifully presented.  The service is attentive but not overbearing.  We'll be back next year!", "time": "2015-11-21", "author": "OpenTable Diner Since 2003", "restaurant": "Blue Ridge Grill"}, {"review": "Markus our server was fantastic. The onion on the steak made all the difference in the world", "time": "2015-11-20", "author": "OpenTable Diner Since 2012", "restaurant": "Blue Ridge Grill"}, {"review": "After a hard day at the Art Museum and Piedmont Park with grandkids we decided we'd like a quiet early dinner out on our way back to the burbs.  Stopping at Blue Ridge Grill was the right choice.  Our server, Sandra, was delightful and full of enthusiasm.  The food was divine and correctly proportioned, and the wine a delicious compliment.  We were talked into a mini-dessert (fudge mousse) which put us over the top!  PERFECT.  Good night Atlanta.", "time": "2015-11-20", "author": "Grammy4", "restaurant": "Blue Ridge Grill"}, {"review": "An Atlanta favorite! Excellent service and very attentive. Try the Lobster Salad or the BRG Burger.", "time": "2015-11-20", "author": "Brian9672", "restaurant": "Blue Ridge Grill"}, {"review": "I've been going to Blue Ridge Grill for many years. It's always for business where good food, location and atmosphere is a must. \nThe only complaint I have (and this is the very first) was we had a 6PM Wednesday reservation - early evening, middle of the week, so there were a lot of tables open. We were shown a table in the very back of the restaurant, right next to the service station. Now, the three of us had just gotten off a  5 hour flight from California, so we were dressed comfortably...not sure if our attire made a difference...probably so. \nTo the credit of Blue Ridge, I made a comment and they immediately sat us in a very appropriate booth in the main restaurant. \nWe all had the Filet Oscar and it was quite good. The wait staff was excellent!\nI always recommend Blue Ridge to anyone looking for a great place on the north side of Atlanta.", "time": "2015-11-18", "author": "LarryB", "restaurant": "Blue Ridge Grill"}, {"review": "If you are looking for a great overall experience, this is the place. The food, service, & ambiance were wonderful.", "time": "2015-11-17", "author": "Fantasia97", "restaurant": "Blue Ridge Grill"}, {"review": "we were celebrating a friend's birthday and all had the chef's scallop special last Saturday - delicious. Put it on the menu!", "time": "2015-11-14", "author": "OpenTable Diner Since 2007", "restaurant": "Blue Ridge Grill"}, {"review": "Everything was great, our waiter had us wait  a bit too long at he beginning but made up real quick.", "time": "2015-11-14", "author": "NG23", "restaurant": "Blue Ridge Grill"}, {"review": "Exceptional luxury dining experience. The inviting & warm ambiance, first class service and  exquisite menu make this a luxury dining experience that you should add to your list. Perfect for a special occasion.", "time": "2015-11-13", "author": "PBchVisitor", "restaurant": "Blue Ridge Grill"}, {"review": "Sunday we dined for my 45th birthday and the crew went out of their way to make the evening special -- even down to specially printed menus for the dinner.  While accustomed to such touches dining in the premium establishments at Disney World, I have never experienced such a personal touch in Atlanta.\nThen, on this particular evening, we'd finished an evening with Giada DeLaurentis at The Fox and made a reservation at 8:45 for 9:00.  Just enough time to get there.  As always we were personally greeted upon check-in and another outstanding dining experience.  Thanks to the Chef and crew, this older Irish Catholic long since burned out by Friday Fish growing up, I have learned again to dine on more than just tuna.  The black cod was incredible.", "time": "2015-11-12", "author": "Govig", "restaurant": "Blue Ridge Grill"}, {"review": "First time visitor with business guest from out of town. Was blown away by the service and menu selection. Very down to earth and friendly environment. GREAT JOB!", "time": "2015-11-09", "author": "SLWilkerson", "restaurant": "Blue Ridge Grill"}, {"review": "great steak and sides", "time": "2015-11-09", "author": "urbandinerinAtlanta", "restaurant": "Blue Ridge Grill"}, {"review": "My first measurement of a restaurant is the quality of the food and overall the Blue Ridge Grill delivered.   My pecan stuffed chicken was very good. However, there are several places in Atl to get very good food so quality of service is the tie breaker and that's where the meal broke.   We did receive a very friendly greeting from the staff of three or four individuals who were manning the front station we were seated promptly. The problem arose when we sat there watching other diners being seated and their waiters taking their orders.   We were sitting right next to the front station so I don't know how they wouldn't have noticed our extended wait and several waiters passed by without making any eye contact at all.  Finally, as we were about to leave our waiter arrived and did apologize for being  late.   These things happen but I was surprised that no other employee  had approached us to go ahead and take our wine or appetizer order.   As I mentioned earlier my food was very good and I would recommend it to anyone, but if you are looking to feel special or at least have your very hungry presence acknowledged you might look elsewhere.", "time": "2015-11-07", "author": "kgatthetable", "restaurant": "Blue Ridge Grill"}, {"review": "Great service, food was excellent.  ambiance was nice but it did get loud as it got more crowded.", "time": "2015-11-07", "author": "OpenTable Diner Since 2015", "restaurant": "Blue Ridge Grill"}, {"review": "celebrating a special occasion and the staff went out of their way to truly make it special", "time": "2015-11-07", "author": "OpenTable Diner Since 2013", "restaurant": "Blue Ridge Grill"}, {"review": "Have dined here many times and always have an excellent experience be it lunch, dinner or just drinks.  This occasion was our 40th anniversary and the resturant without asking decorated our table, greeted us with a happy anniversary and comp us dessert.  Made a nice evening even nicer.  The new item of a duck pot pie was excellent and the wine list remains broad and interesting.", "time": "2015-11-06", "author": "OpenTable Diner Since 2009", "restaurant": "Blue Ridge Grill"}, {"review": "Blue Ridge has gotten expensive. We go there a lot. Haven't gotten out of there for less than $180 for two.", "time": "2015-11-06", "author": "BRICKLEB", "restaurant": "Blue Ridge Grill"}, {"review": "Wonderful experience for our anniversary!!", "time": "2015-11-06", "author": "OpenTable Diner Since 2007", "restaurant": "Blue Ridge Grill"}, {"review": "Very enjoyable evening, great food, great service and all around good experience.", "time": "2015-11-02", "author": "enjoyed", "restaurant": "Blue Ridge Grill"}, {"review": "Another great experience at Blue Ridge!  We keep coming back for the food and service.  I tried the lamb chops for the first time...Delish!  \nPatrick is the best!", "time": "2015-10-31", "author": "Nemos", "restaurant": "Blue Ridge Grill"}, {"review": "The atmosphere is still great and inviting, but the food is not as good as I remembered for the price you pay.  The sides and salad were extra and expensive--$9 for sides and $13 for  their house salad.  We both ordered the scallops and were a little disappointed in the flavor of the dish.  It seemed to overpower the natural sweetness of the scallops.  And while the scallops were large, there were only 3 in each dish for $28.  We did enjoy having a quiet, more private booth in a very pleasing and enjoyable atmosphere.  The service was very attentive and friendly as were the host and hostess upon arriving.", "time": "2015-10-31", "author": "SmokeRise2", "restaurant": "Blue Ridge Grill"}, {"review": "Firstly, I can't say enough of the staff's professional and courteous approach to serving. That in itself was a fantastic experience. The server was knowledgeable and the food was excellent all around. I was a little disappointed in the dessert selection hence the 4 stars. What I liked about the food was its simplicity, right sized portions, and freshness. There is a lounge area where you can relax and wait which is fantastic incase you get there early. That way you are not standing in the entry area. They serve you drinks and snacks. Seating was prompt per our reservation and service was quick and non-intrusive. Ambiance was good - not too quiet but not too loud. We were able to chat without yelling or shouting and the tables are well laid out to provide privacy. \nThis is not a 'party' restaurant. This is a relaxing restaurant that focuses on service and excellent food - great for special occasions.", "time": "2015-10-31", "author": "RRTrrtRRT", "restaurant": "Blue Ridge Grill"}, {"review": "Our server Rog was quite simply amazing. Any time we needed anything she was there without us asking. BRG is lucky to have her. Food was amazing. Best in Atlanta.\nCome on In!!!!!", "time": "2015-10-27", "author": "OpenTable Diner Since 2005", "restaurant": "Blue Ridge Grill"}, {"review": "Always consistent food and service. Matt did a fantastic job working with the chefs to accommodate my wife's dietary restrictions.", "time": "2015-10-26", "author": "NSBDMG", "restaurant": "Blue Ridge Grill"}, {"review": "From the decor to the server, our first visit to the Blue Ridge Grill was extra special. Our server, Jesse, hit a particular high note with me as he is a fellow Brooklynite. He was attentive and seemed to anticipate our needs. We will come back and bring our friends and family.", "time": "2015-10-22", "author": "Usatran", "restaurant": "Blue Ridge Grill"}, {"review": "Good reliably consistent business lunch spot in Buckhead", "time": "2015-10-22", "author": "FoodieATL", "restaurant": "Blue Ridge Grill"}, {"review": "It has been over 20 years since I was here last, and again I am not disappointed in the result.  Excellent fare, great atmosphere, and VERY attentive service.  We will be back", "time": "2015-10-21", "author": "ChefBoyRDoom", "restaurant": "Blue Ridge Grill"}, {"review": "The service , food and atmosphere are always outstanding.   Long time staff are helpful and dependable. They know their customers, their coworkers and their food and care to make every meal top notch.", "time": "2015-10-20", "author": "outstanding", "restaurant": "Blue Ridge Grill"}, {"review": "The bread comes so hot you can not touch it--but when you can it is excellent.  This is an excellent restaurant with valet parking near I 75 but it is more the feel of a neighborhood meeting place.  I enjoy the half deserts as I like something sweet but not huge.", "time": "2015-10-19", "author": "grande", "restaurant": "Blue Ridge Grill"}, {"review": "We went here to celebrate our anniversary. A gift from our kids. From the moment we exited the car, the experience was 5 *!  Our waiter, Jessie, was so attentive. He and the rest of the staff made it excellent. The filet mignon is the best we have had in this city!  All of the food as well as the drinks were exquisite. And they surprised us with a wonderful celebratory Baked Alaskan for desert!!!   We are looking forward to going back during the holidays!!", "time": "2015-10-17", "author": "PhyllisP", "restaurant": "Blue Ridge Grill"}, {"review": "Excellent food with a very nice selection of both fish and meat. Very nice wine list. Service was superb. Server was helpful and attentive.", "time": "2015-10-17", "author": "Hugh", "restaurant": "Blue Ridge Grill"}, {"review": "We went for our 17th anniversary dinner.  They had a little bit of confetti on the table to alert all our servers to the occasion.  Our server Abby was top notch!  We we offered a choice of complementary champagne or dessert as part of the celebration.  We let our server know that we were not in a rush for the evening and she spaced out all the food very nicely.  Would go again for a special occasion.", "time": "2015-10-17", "author": "sfmarietta", "restaurant": "Blue Ridge Grill"}, {"review": "Very nice food, service and ambiance \nA \"can't miss\" restaurant -\nHighly recommend to all -especially if from out of town - a great sampling of southern manners and cuisine - w/o the gushing", "time": "2015-10-13", "author": "Jeff", "restaurant": "Blue Ridge Grill"}, {"review": "I love love love BRG... The food, the staff, the ambiance... I always have to talk myself out of licking the plate as I'm sure it would be frowned upon :)", "time": "2015-10-09", "author": "OpenTable Diner Since 2015", "restaurant": "Blue Ridge Grill"}, {"review": "Really enjoyed the Food and our server was awesome. I totally forgot his name but he was very patient and genuine and it was close to closing but he did not rush us.", "time": "2015-10-04", "author": "OpenTable Diner Since 2013", "restaurant": "Blue Ridge Grill"}, {"review": "I have learned in the past to ask about the prices on specials. I went for the Whole Flounder as they describe it. However when it came out, total amount of fish was 6-8 oz, in other words about the size of a normal fish entree. When I got check, price for this was $45, are you serious?? Most expensive fish entree on regular menu is $30. This happens too often, restaurants push their specials and hope that you do not ask what price is. Would never have ordered this entree at that price. Yes it was good, and the restaurant did make my wife's birthday feel special, but I do felt that I was ripped off.", "time": "2015-10-03", "author": "tthomp2", "restaurant": "Blue Ridge Grill"}, {"review": "Great location.", "time": "2015-10-03", "author": "OpenTable Diner Since 2015", "restaurant": "Blue Ridge Grill"}, {"review": "The food at Blue Ridge was excellent and the atmosphere so relaxing and comfortable. But what really sets this restaurant above others in its category is the service:  warm and friendly yet knowledgeable and professional.   The wine selection was good and the wine pours were generous.", "time": "2015-10-02", "author": "OpenTable Diner Since 2011", "restaurant": "Blue Ridge Grill"}, {"review": "Blue Ridge Grill never dissapoints for consistently excellent food and service.", "time": "2015-09-30", "author": "JimsGems", "restaurant": "Blue Ridge Grill"}, {"review": "Blue Ridge Grill provides great service and good food.  I book them for most of my business lunches.", "time": "2015-09-28", "author": "Connoisseur100", "restaurant": "Blue Ridge Grill"}, {"review": "This was my second time here and it did not disappoint.  We were celebrating my daughters birthday and she was so pleased with the little table decorations and birthday menu.  And of course, was surprised and grateful for the amazing birthday baked Alaska dessert.   Everything was delicious and although my meal that I first ordered was cooked perfectly, it was just not to my particular taste.  The chef happily prepared a different entre for me at no extra cost.  This was above and beyond.  All the little details, superb wine list and wonderful food and atmosphere truly make us love this restaurant.", "time": "2015-09-22", "author": "OpenTable Diner Since 2007", "restaurant": "Blue Ridge Grill"}, {"review": "Once again the BRG went above and beyond. Service was top notch as always. We had out favorite server take care of us again. Evan is truly great at his craft. My wife and I took her parents out to celebrate there birthdays and it was flawless. Highly recommend it.", "time": "2015-09-20", "author": "OpenTable Diner Since 2005", "restaurant": "Blue Ridge Grill"}, {"review": "My husband and I had a reservation for our third wedding anniversary. Blue Ridge Grill was perfect. Both our host and server congratulated us, our table was decorated and the menus were anniversary versions. The food was amazing, we both had two of that night's specials, the flounder and trout. Cooked perfectly. The inside of the restaurant looks like a very upscale lodge and was mood lit, while there was more than enough lighting at each individual table to be able to see what you were dining on. Dress would be business casual and up, and with a possible exception for lunch, kids might not find anything they really want to eat on the menu. (Our toddler stayed home with family that night) The staff is very knowledgeable, friendly, and attentive without being disruptive. We had an absolutely wonderful evening, and would highly recommend the restaurant.", "time": "2015-09-20", "author": "Kathleen", "restaurant": "Blue Ridge Grill"}, {"review": "Outstanding food and outstanding service. It's one of the best run and manage restaurants in all of Atlanta. Patrick, the general manager always does a great job.", "time": "2015-09-18", "author": "KenKingery", "restaurant": "Blue Ridge Grill"}, {"review": "Steaks and sides were great. Great bread pudding to finish it off.", "time": "2015-09-13", "author": "jimbo", "restaurant": "Blue Ridge Grill"}, {"review": "Great restaurant... food... service. \nIt was a busy Saturday night with a lively crowd ... Every table was taken. We were seated very promptly .. Had immediate excellent service. My steak was delicious and my husband had the duck. He loved it. We shared a fabulous corn soufflé and spinach.  We love this restaurant .", "time": "2015-09-13", "author": "AnnieH21", "restaurant": "Blue Ridge Grill"}, {"review": "Exceptional.  I booked online, and made a special request that we have the same table as on our first date one year ago.  They were not only able to accommodate, but seemed genuinely pleased to do so.  The filet was outstanding, and the service was first rate.  An after dinner drink on the patio is highly recommended.  We will be back, time and again:).", "time": "2015-09-12", "author": "OpenTable Diner Since 2012", "restaurant": "Blue Ridge Grill"}, {"review": "I scheduled an early dinner to celebrate our anniversary before a Cobb Energy Center show.  We arrived and the table was specially decorated just for us.  The food was great as was the service.  We'll definitely be back!", "time": "2015-09-12", "author": "Mikey", "restaurant": "Blue Ridge Grill"}, {"review": "We celebrated our wedding anniversary at the Blue Ridge Grill and the restaurant was most accommodating. making us feel very welcome and special. The service was fantastic and the food was delicious! This was our first visit but we will be back.", "time": "2015-09-11", "author": "wpm0307", "restaurant": "Blue Ridge Grill"}, {"review": "We all chose the filet and got them 3 different temperatures and they were all perfectly prepared. Best filet I've had in a long time!", "time": "2015-09-11", "author": "brendaandmeredith", "restaurant": "Blue Ridge Grill"}, {"review": "Great restaurant, we go there for a lot of special occasions.   Our son's favorite restaurant, go every year for his birthday.", "time": "2015-09-11", "author": "luvseafood", "restaurant": "Blue Ridge Grill"}, {"review": "Food was excellent and the service was exceptional as usual, friendly prompt and anticipated.", "time": "2015-09-11", "author": "OpenTable Diner Since 2005", "restaurant": "Blue Ridge Grill"}, {"review": "This is by far my favorite restaurant in all of Atlanta. It has just the right balance of everything. Prepare to indulge yourself just a bit while you enjoy a fantastic dinner. Don't forget to order an extra corn soufflé ... I bet you can't eat just one ! I love this special place.", "time": "2015-09-09", "author": "TLB4LA", "restaurant": "Blue Ridge Grill"}, {"review": "Will definitely return again.  The service was excellent & the food was perfect.  I entertained a client and it was just a very relaxing & pleasant experience.", "time": "2015-09-09", "author": "OpenTable Diner Since 2011", "restaurant": "Blue Ridge Grill"}, {"review": "Five star all the way.  It was a perfect way to spend our wedding anniversary.", "time": "2015-09-05", "author": "BenB", "restaurant": "Blue Ridge Grill"}, {"review": "We went to Blue Ridge for our anniversary, and mentioned that in the reservation. They went out of their way (I don't want to spoil the surprise for others) to make us feel special, and I couldn't have asked for a better dinner. We split the trout, a salad, and 2 family style sides.  Oh, and of course dessert. It's a meal I won't forget, and I've already recommended it to many others. Hopefully we'll be back sooner rather than later!", "time": "2015-09-05", "author": "OpenTable Diner Since 2009", "restaurant": "Blue Ridge Grill"}, {"review": "I have driven by this restaurant many times and it just never came up on my Radar Screen. The Sign for this restaurant just does not do it justice!  One of  our friends heard that it was good- so, we gave it a try last night.  Everything was GREAT!! The maître 'de was welcoming and sat us at a Great Booth. John was our waiter and he and his assistant were fantastic.  The Bread was great (the same loaf that they serve at Bones - a sister restaurant). The food was prepared just right and was served in a timely fashion.  The drinks were great and the right size.   We plan to return soon !! Give it a try - you will not be disappointed.", "time": "2015-09-05", "author": "MikeandSusie", "restaurant": "Blue Ridge Grill"}, {"review": "Good food.  Service with a bad  attitude.  We waited a long time for everything.", "time": "2015-09-02", "author": "FriendfromAtlanta", "restaurant": "Blue Ridge Grill"}, {"review": "Great atmosphere and very good cooking in this place. They should quote the price of the specials when they present them, as I felt somewhat clipped when I checked over the bill the next morning.", "time": "2015-09-01", "author": "notnicknolte", "restaurant": "Blue Ridge Grill"}, {"review": "Party of four for brunch.  Food and service was outstanding, and the restaurant always is so warm and inviting.", "time": "2015-08-30", "author": "GTJacket71", "restaurant": "Blue Ridge Grill"}, {"review": "Our favorite spot in town.  No question.  Food, service and menu second to none.", "time": "2015-08-30", "author": "Flavas", "restaurant": "Blue Ridge Grill"}, {"review": "It was my wife's birthday and we decided to go somewhere different than our normal restaurants.  No strangers to Blue Ridge but hadn't been there for about a year.  I noted on the Open Table reservation that it was my wife's birthday, knowing sometimes the server might acknowledge the occasion.  We arrived and the host did wish her a happy birthday.  We were seated and birthday confetti was on the table.  The menus said Happy Birthday on them.  John, the waiter, couldn't have been more genuine wishing her well on her special day.  He was very attentive without being intrusive, a great experience.  Finally,a birthday surprise flaming Frozen Alaska  birthday dessert.  And a tiny gift box with a special biscotti!  Could we have been more pampered?", "time": "2015-08-29", "author": "OpenTable Diner Since 2006", "restaurant": "Blue Ridge Grill"}, {"review": "My friends and I enjoyed another wonderful meal at the Blue Ridge Grill yesterday.  I can't decide whether the food, service or ambience is the best.  They're all outstanding.   My friend and I share a birthday and no one does a better job on making you feel special than the Blue Ridge Grill, where we always celebrate with our friends.  Even if it's not a special occasion you can't go wrong dining here.  It's always a memorable experience.", "time": "2015-08-27", "author": "Silverspoon", "restaurant": "Blue Ridge Grill"}, {"review": "Business dinner for 6 - service was very slow even though the restaurant was not busy.  Had to ask manager for assistance (which was done) .  The first bottle of red was bad, yet replaced with little problem.  The food was very good the special fish dish of Cordova was outstanding and dinning partners enjoyed the steaks as well.  Service, service, service = happy consumer", "time": "2015-08-23", "author": "OpenTable Diner Since 2009", "restaurant": "Blue Ridge Grill"}, {"review": "What a pleasant surprise. Nice menu ...Use of local ingredients ... Prepared and plated  well ... Nice building and outstanding service", "time": "2015-08-23", "author": "KONICEK", "restaurant": "Blue Ridge Grill"}, {"review": "We eat every year  in August when we attend the Atlanta Shoe Show. It is the first restaurant we hit. The service is stellar always along with the food! Our server Matt was great.", "time": "2015-08-23", "author": "chichipoo", "restaurant": "Blue Ridge Grill"}, {"review": "This is one of my favoirte restaurants in Atlanta.  The service is excellent, and the host usually remembers my name, too. I especially feel at home when relaxing at first on the front porch for a drink before dinner.", "time": "2015-08-23", "author": "Suzanne", "restaurant": "Blue Ridge Grill"}, {"review": "Our first visit was wonderfully memorable! Every member of the staff helped to make our anniversary celebration special. From honoring my special reservation request to the thoughtful touches on the table setting to excellently prepared dishes served by professionals, Blue Ridge Grill provided a thoroughly enjoyable dining experience.", "time": "2015-08-22", "author": "WeissBlitz", "restaurant": "Blue Ridge Grill"}, {"review": "My lamb and my husbands filet was cooked perfectly! The chunks of crab meat in my lobster bisque added a nice richness to it. And the mac and cheese was amazing! It was so cheesy and creamy. It is the best mac and cheese I have ever had. You can't go wrong at the Blue Ridge Grill.", "time": "2015-08-21", "author": "smerylb1", "restaurant": "Blue Ridge Grill"}, {"review": "One of our favorite restaurants to dine at!  Todd was a great waiter, very attentive and great personality.  Thank you!", "time": "2015-08-21", "author": "Rossi", "restaurant": "Blue Ridge Grill"}, {"review": "Still # 1 in Atlanta, the food and service were exceptional!", "time": "2015-08-18", "author": "Moose", "restaurant": "Blue Ridge Grill"}, {"review": "I have dined at Blue Ridge Grill many times over the years as it is always a good choice for business lunch and dinner. This past time was excellent as always from a food and service standpoint, inside the restaurant. Too bad my car was robbed while parked in the valet lot.  I called the restaurant as soon as I arrived home and realized why the stereo didn't sound right. The 12\" subwoofer, box and all, was missing from the back of my Jeep. No idea if it was a valet or simply a thief patrolling the lot but either way it turned out to be a substantially more expensive dinner than usual. The restaurant did follow up with a call a couple days later and asked questions about the incident but nothing came of it. \nI guess I'll stick to Canoe when dining in the area from now on as their valet lot is in clear sight of the restaurant and hopefully less of a risk for break ins.", "time": "2015-08-18", "author": "OpenTable Diner Since 2005", "restaurant": "Blue Ridge Grill"}, {"review": "Outstanding restaurant.  Went for my birthday and they really made it special. Truly enjoyed everything. The food was wonderful. Service is some of the best in the city.  I love this place!!", "time": "2015-08-16", "author": "Jenn8420", "restaurant": "Blue Ridge Grill"}, {"review": "The restaurant is easy to find just off 75 and West Paces Ferry. Valet parking is available and highly recommended. The restaurant is nicely appointed with the feel of a Mountain retreat. Food is good and I would recommend this for a business lunch also. It's not Bachanallia but the overall we were pleased with the food quality and portions sizes.", "time": "2015-08-15", "author": "Dwayne", "restaurant": "Blue Ridge Grill"}]