[{"business_name": "Hop City", "text": "outstanding selection.  good advice.  reasonable pricing.  Plus they will do a special order if you absolutely, must have somthing special.", "review_id": "e62d0f387b1a6d1b2d300eac5a3ba4399778f185721dfd9188f90092", "business_id": "8aFd-A_MxvW3tr3BKOpeWA"}, {"business_name": "Hop City", "text": "Hop City is best described as a shop that sells beer and beer accessories. There is a limited selection of wine, but the majority of the facility is dedicated to satisfy the growing craft beer trendWhen you walk into the facility, you'll notice shelves and shelves loaded with different kinds of beer. If you turn right, you'll see that the room opens up to a more industrial presentation where home brew kits and equipment can be found. They sell a whole variety of different hops and grains that you can use for your own home brew. Along the wall are 50 unique taps of brews for your choosing. I elected to try a stout, but was told they couldn't give out samples. So i elected to get a 32 oz of it. When the staffer started the tap, it quickly ran out. So after 15 minutes of finding the \"keg guy\", he stated that there just isn't anymore in the back. After the disappointment, i elected to get the next stout i saw... to which the staffer told me... \" I wish i was joking, but this ones also out too...\"On the third try, I elected to get a dark coffee porter which he was able to fill up.Hop City is every craft beer fan's dream, despite having unfortunate experience, I am still a fan of Hop City.", "review_id": "3072fdcca24d505d0b8e4e15e4199ae46a256f57444152a4956d9819", "business_id": "8aFd-A_MxvW3tr3BKOpeWA"}, {"business_name": "Hop City", "text": "This place is incredible. Amazing selection of craft beer at very reasonable prices. They have about 40 taps as well, for you growler people. Due to Fulton county laws, there is no sampling allowed (major bummer). For the cans and bottles, they allow you to build your own 6 pack, using any beer found in the store...meaning you can pull a beer out of a 6 pack and put that now 5 pack on the floor, so they can now sell the rest as singles. My interactions with the staff were nothing but positive. They were all extremely helpful and very knowledgable. Honestly, this place has an unbeatable selection and vast variety. This is a true diamond in the rough!", "review_id": "ff0f054e892bb8be765b104988837ffb9ac74c8f7164dd1f28d3a397", "business_id": "8aFd-A_MxvW3tr3BKOpeWA"}, {"business_name": "Hop City", "text": "A friend told me about Hop City as I was working on creating a personalized beer subscription as a gift. My initial visit was in December. I am not a beer drinker so there was a level of struggle related to planning this gift. After doing my research I had a few beers I wanted to purchase and they were easy to find with their signage. An employee gave me a few suggestions to purchase as well.My next visit was in February looking for additional beers. Their selection is large and the specialty beer section on the side was an added bonus. I enjoyed choosing from fall and winter seasonal beers. I ventured over to the wine section this visit and spend 30 minutes wondering around. I ended up trying a wine I found and loved it!The employees are very friends and knowledgeable. They are quick to jump on a register if there are 2 people in line.", "review_id": "ff5a18c89c97124f4be08ae8146a54b4f60d51c7b1619afe89884abf", "business_id": "8aFd-A_MxvW3tr3BKOpeWA"}, {"business_name": "Hop City", "text": "A friend of mine asked me to find him a specific type of beer, so I went to Hop City. I'm not particularly knowledgeable about beer, so I definitely needed assistance. They didn't have hopsolution in stock, but were able to direct me to a comparable beer. My friend loved the recommendations that they made. Super friendly and helpful staff, easy parking, and wide selection. What's not to love?", "review_id": "391e0656ebbfde3ca819eec5db18f46ccf7202eb124f5351f1cd2cd5", "business_id": "8aFd-A_MxvW3tr3BKOpeWA"}, {"business_name": "Hop City", "text": "It's small but impressive shop with wines and beers. They are organized by styles and/or regions. The staff was friendly and answered all of my questions.There is a growler station with over 40 options! In the back, there is a small section of home brewing supplies. While I was browsing, I overhead another customer accessing her boyfriend's wishlist. That's awesome, so grab your loved one options they have been wanting. If I lived in the Atlanta, I would be here at least twice a month. I grabbed a t-shirt for my boyfriend since you can't bring liquids over 3.4 on a carry on- Thanks TSA!You can create your own four or six packs by adopting beers, grab a bottle for your grape loving friends and/or grab supplies to brew beer - go and hop on in!", "review_id": "777173294b0e8f217557abf4a33fe8c53cb9346189b5dc7d08ffcfb5", "business_id": "8aFd-A_MxvW3tr3BKOpeWA"}, {"business_name": "Hop City", "text": "I'm a mom who likes wine (so basically, a mom).  Sometimes Hop City has long lines of people on the weekends at their bar, but they get five stars from me because they led me to a very important discovery.Here is the context, once a week my husband and I usually split a bottle of wine.  When he goes out of town, this is a problem, because I can't drink a whole bottle by myself, but I still want to relax and wind down!  However, if he's out of town it's either commit to the whole bottle, drink and toss half (what a tragic waste!), or drink half one night and save the other half for a less satisfying second night (sad).  ENTER THE UNDERWOOD CAN OF WINE.  What's that you say?  There's a way I can enjoy a couple glasses by myself without committing to a whole bottle?!?!  Thanks Hop City!So yeah, a clever operation in the corner of Krog Street Market, where you can swing in get your craft beers, bottles (or cans!) of wine, with an interesting, unique selection.  If you're eating at Krog, it's a great place to grab a glass of wine, but I think they are known for beer, but I'm not a beer drinker.  They do serve generous portions of wine at the bar!  And they enabled my weekend drinking by introducing me to the can of Underwood Pinot Noir and Pinot Gris.  I think they have a rose version too, but really, who cares? Also, they have a range of prices in wines, and I'm kind of a \"bottle should be under 15\" kind of gal and can always find something interesting and delicious.  And if you're a high roller, 1%er kind of person, they have bottles over $100 too!  (Seriously, is that quantifiably better than a $15 bottle?  I am very curious, thanks).", "review_id": "0dee7991f977df0d0901de00da53552d0862e7986f2856bed009005c", "business_id": "8aFd-A_MxvW3tr3BKOpeWA"}, {"business_name": "Hop City", "text": "I looooove Hop City. There's always something interesting to find, whether it's in bottles or a growler. The growler selection is always on point, and they dedicate a good amount of taps to Georgia beers. Now the real reason I'm loving Hop City these days is home brewing. They do a homebrewing class on Saturdays, I think it's down to once a month. There's a deal through Scoutmob for a growler along with it, which is the route I went. Keep in mind if you're interested, it takes place outside.The class was about 3 hours long and we went through the makings of an entire 5 gallon batch of beer, while tasting a couple beers brewed in prior classes. And if you're further along that you don't need a class (but really, if you learn best from watching and getting to participate, this is PERFECT), the homebrewing section of the store is soooo great. They're definitely more geared toward 5 gallon brewing, but they will scale down recipes to suit your needs (like I'm only doing 1 gallon batches). This will definitely be the only place I come to for supplies. While the internet is great and all, getting to discuss your ideas and figure out how to tweak things with someone who knows their stuff is way more valuable to me than saving a couple bucks.", "review_id": "229fa7026dba4b2f75f5a8b4de32953a23f4ab269a39c90b864757ce", "business_id": "8aFd-A_MxvW3tr3BKOpeWA"}, {"business_name": "Hop City", "text": "Amazing selection! Awesome employees!When I lived in ATL I would fill up my growler here at least twice a week. They are constantly changing what they have on tap. It was pretty daunting trying to select a brew the first few times I walked in here, but the employees gave me amazing recommendations. Along with being super friendly, they are extremely knowledgeable and you will always walk out with a brew or wine that you will enjoy!", "review_id": "ddd7153cfa66c4abd0a7326b2af7a259644db63f4b0b59b492fde8db", "business_id": "8aFd-A_MxvW3tr3BKOpeWA"}, {"business_name": "Hop City", "text": "If you haven't heard of Hop City by now you either don't like beer, don't live in Atlanta, or you don't go out (That's ok, I know how rough breakups can be). No matter what your excuse is, you need to do yourself a favor and visit. Hop City is similar to Total Wine minus the liquor but with smaller batch beers that you probably won't find anywhere but a boutique shop. Their staff is also much friendlier and more knowledgable. Not sure what you want? I don't blame you. When you walk in and see thousands of different beers and wines it can get overwhelming! Their staff is great and making recommendations because they enjoy what they do and they are great at describing the beers. One of the best things about the West Midtown location is the growler shop. It's attached to the store and provides a nice selection of beers that constantly rotates. Once one beer is gone, which can happen very quickly based on the keg, something else takes it place. They have about 40 different beers on tap, making it a great way to try different things. Already have a growler from somewhere else? As long as it has the government warning label you can bring it in and they will fill it. Unfortunately, due to liquor laws there are no samples or open containers in the growler shop. This is contrasted with their location in the Krog Market which has a bar outside their shop. A conversation with one employee revealed that except for Sunday's you can walk around with open containers from the shop. Both locations have something unique to offer while still having a brilliant selection of hard to find, cult classic, or down right rare beers. For the craft beer lover this is one of the city's gems.", "review_id": "15e16ece4c5150013f83058262ec3304f75aa91b1baa9c17a5508317", "business_id": "8aFd-A_MxvW3tr3BKOpeWA"}, {"business_name": "Hop City", "text": "Very cool place, they have a wide range of beer and wine. There was this very kind man that helped me find what I was looking for. I thought they had samples but they don't", "review_id": "ba4976f4dacf5ec26d111066db5aab60cf03f31c66b106a0d4de21da", "business_id": "8aFd-A_MxvW3tr3BKOpeWA"}, {"business_name": "Hop City", "text": "I love Hop City! There beer selection is huge and I can't wait to be back! #BeltlineDaze", "review_id": "3c8631a09fc103ddf73b6908d6573864d1867730a4db06bc936a1a5e", "business_id": "8aFd-A_MxvW3tr3BKOpeWA"}, {"business_name": "Hop City", "text": "Hey! Remember that time you liked beer? Or that time you were from Georgia Tech and liked different types of beer? Georgia State? That's cool, too. Just drink beer. \"\"But we'll help if you don't know what you like. Todd and all the other folks are very helpful in providing you with a drink and something OCD people will look forward to with IBUs and hop potencies.... but that's none of my business. \"", "review_id": "fc1e1c12f373b2e0f0135483a9beb64e6dc022443459b4e3f0da8e8d", "business_id": "8aFd-A_MxvW3tr3BKOpeWA"}, {"business_name": "Hop City", "text": "Fun place to get a beer and walk around.  Great selection of new beers to try and local breweries. Not sure if I am a fan of the two lines to get a drink... it gets a little confusing when it was very crowded on a Friday night, but we will be back!", "review_id": "10b7b6110a477ef388c93ec09bce79a84425ec4900c239fd1aa1706f", "business_id": "8aFd-A_MxvW3tr3BKOpeWA"}, {"business_name": "Hop City", "text": "Love Hop city ! All the employees are super knowledgeable and eager to help . Will continue to frequent this fine craft beer store when I'm in the area .", "review_id": "1fc45749bcaeae7c40427eefcbb3aca7407a2b294391a26935280656", "business_id": "8aFd-A_MxvW3tr3BKOpeWA"}, {"business_name": "Hop City", "text": "Great for a walk-around beer at Krogg. Very good selection of beers.", "review_id": "2370bb29b7bea256197943970071d244f3a787b0ef8109289f522394", "business_id": "8aFd-A_MxvW3tr3BKOpeWA"}, {"business_name": "Hop City", "text": "Great place to get craft beers. The staff are always so helpful, just ask them anything. There's a single beer selection on the left side of the store if you don't want to buy a 6-pack. They also have great growler selection, although I never got a growler container since my bf and I like trying a large variety of beers rather than a large quantity of a single beer. If you plan to be a regular, put your name in their system so that you can get some neat stuff, but we haven't gotten any yet.", "review_id": "663e606535d8527e04d7608905080e7f9ae8eef588df62ab9edbee99", "business_id": "8aFd-A_MxvW3tr3BKOpeWA"}, {"business_name": "Hop City", "text": "Great local shop for beer, wines, and ciders. No hard liquor to be had, but the selection of what they DO have is great. I'm a cider drinker and I found lots of different varieties to try. They were more than happy to let me make up my own 6-pack rather than buy multiples of something unfamiliar. They happily made recommendations for DH based on beers that he told them he liked. If we lived in the area we'd definitely be here again.", "review_id": "2974c6a418d305272bd4f61fb482c2db69dabee3389a8a11755d9b45", "business_id": "8aFd-A_MxvW3tr3BKOpeWA"}, {"business_name": "Hop City", "text": "Huge craft beer shop; lots of selection; super friendly staff.I know I must really like a place if I would want to work here. It just seems really awesome and the attitude of everyone there was great.Can't wait to come back!", "review_id": "3d7ccf1a3d3eb84b5564ad411e4aa7ea930ea281f9f3b81cd5014e65", "business_id": "8aFd-A_MxvW3tr3BKOpeWA"}, {"business_name": "Hop City", "text": "I always think we've got a pretty hoppin' beer scene (that's right, I said it) in Chattanooga... Until I spend a weekend in Atlanta! Holy crap, this place is awesome. My sweetie and I came by here on a quiet Sunday afternoon, after a tasting & tour at the pretty nearby Red Brick Brewery. As they don't sell beer at the brewery, we were in search of more if their brews to fill my growler. We were not let down-- Hop City had 30 beers on tap, with a large number of pulls devoted to Georgia/local beers. (We went with the Red Brick Tripel aged in rum barrels, if you're interested.) Our only complaint was that we weren't able to taste anything before purchasing, but I'm sure that's a legal thing not the choice of the retailer. We were a bit overwhelmed by the number of bottles to choose from too... But am happy to say that the staff was super knowledgeable and helpful in making some selections. My sweetie mentioned that he wanted to retry a beer in a style that doesn't usually thrill him, the associate working there was happy to make suggestions based on his usual taste/style preferences. This guy was a total pro! Needless to say, a return trip to Hop City is definitely on our agenda next time we're in the ATL.", "review_id": "d94f1c5164fc855b552db9cfba1102e6ccedecee788d3b4ade7ea95f", "business_id": "8aFd-A_MxvW3tr3BKOpeWA"}]